Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define ADTBL23 ADTBL23
extern volatile unsigned int  ADTBL23 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL23BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL23BITS;
extern volatile ADTBL23BITS ADTBL23bits __attribute__((__sfr__));

#define ADTBL24 ADTBL24
extern volatile unsigned int  ADTBL24 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL24BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL24BITS;
extern volatile ADTBL24BITS ADTBL24bits __attribute__((__sfr__));

#define ADTBL25 ADTBL25
extern volatile unsigned int  ADTBL25 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL25BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL25BITS;
extern volatile ADTBL25BITS ADTBL25bits __attribute__((__sfr__));

#define ADTBL26 ADTBL26
extern volatile unsigned int  ADTBL26 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL26BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL26BITS;
extern volatile ADTBL26BITS ADTBL26bits __attribute__((__sfr__));

#define ADTBL27 ADTBL27
extern volatile unsigned int  ADTBL27 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL27BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL27BITS;
extern volatile ADTBL27BITS ADTBL27bits __attribute__((__sfr__));

#define ADTBL28 ADTBL28
extern volatile unsigned int  ADTBL28 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL28BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL28BITS;
extern volatile ADTBL28BITS ADTBL28bits __attribute__((__sfr__));

#define ADTBL29 ADTBL29
extern volatile unsigned int  ADTBL29 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL29BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL29BITS;
extern volatile ADTBL29BITS ADTBL29bits __attribute__((__sfr__));

#define ADTBL30 ADTBL30
extern volatile unsigned int  ADTBL30 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL30BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL30BITS;
extern volatile ADTBL30BITS ADTBL30bits __attribute__((__sfr__));

#define ADTBL31 ADTBL31
extern volatile unsigned int  ADTBL31 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL31BITS {
  union {
    struct {
      unsigned ADCH:7;
      unsigned :7;
      unsigned DIFF:1;
      unsigned UCTMU:1;
    };
    struct {
      unsigned ADCH0:1;
      unsigned ADCH1:1;
      unsigned ADCH2:1;
      unsigned ADCH3:1;
      unsigned ADCH4:1;
      unsigned ADCH5:1;
      unsigned ADCH6:1;
    };
  };
} ADTBL31BITS;
extern volatile ADTBL31BITS ADTBL31bits __attribute__((__sfr__));

#define ADRES0 ADRES0
extern volatile unsigned int  ADRES0 __attribute__((__sfr__));
#define ADRES1 ADRES1
extern volatile unsigned int  ADRES1 __attribute__((__sfr__));
#define ADRES2 ADRES2
extern volatile unsigned int  ADRES2 __attribute__((__sfr__));
#define ADRES3 ADRES3
extern volatile unsigned int  ADRES3 __attribute__((__sfr__));
#define ADRES4 ADRES4
extern volatile unsigned int  ADRES4 __attribute__((__sfr__));
#define ADRES5 ADRES5
extern volatile unsigned int  ADRES5 __attribute__((__sfr__));
#define ADRES6 ADRES6
extern volatile unsigned int  ADRES6 __attribute__((__sfr__));
#define ADRES7 ADRES7
extern volatile unsigned int  ADRES7 __attribute__((__sfr__));
#define ADRES8 ADRES8
extern volatile unsigned int  ADRES8 __attribute__((__sfr__));
#define ADRES9 ADRES9
extern volatile unsigned int  ADRES9 __attribute__((__sfr__));
#define ADRES10 ADRES10
extern volatile unsigned int  ADRES10 __attribute__((__sfr__));
#define ADRES11 ADRES11
extern volatile unsigned int  ADRES11 __attribute__((__sfr__));
#define ADRES12 ADRES12
extern volatile unsigned int  ADRES12 __attribute__((__sfr__));
#define ADRES13 ADRES13
extern volatile unsigned int  ADRES13 __attribute__((__sfr__));
#define ADRES14 ADRES14
extern volatile unsigned int  ADRES14 __attribute__((__sfr__));
#define ADRES15 ADRES15
extern volatile unsigned int  ADRES15 __attribute__((__sfr__));
#define ADRES16 ADRES16
extern volatile unsigned int  ADRES16 __attribute__((__sfr__));
#define ADRES17 ADRES17
extern volatile unsigned int  ADRES17 __attribute__((__sfr__));
#define ADRES18 ADRES18
extern volatile unsigned int  ADRES18 __attribute__((__sfr__));
#define ADRES19 ADRES19
extern volatile unsigned int  ADRES19 __attribute__((__sfr__));
#define ADRES20 ADRES20
extern volatile unsigned int  ADRES20 __attribute__((__sfr__));
#define ADRES21 ADRES21
extern volatile unsigned int  ADRES21 __attribute__((__sfr__));
#define ADRES22 ADRES22
extern volatile unsigned int  ADRES22 __attribute__((__sfr__));
#define ADRES23 ADRES23
extern volatile unsigned int  ADRES23 __attribute__((__sfr__));
#define ADRES24 ADRES24
extern volatile unsigned int  ADRES24 __attribute__((__sfr__));
#define ADRES25 ADRES25
extern volatile unsigned int  ADRES25 __attribute__((__sfr__));
#define ADRES26 ADRES26
extern volatile unsigned int  ADRES26 __attribute__((__sfr__));
#define ADRES27 ADRES27
extern volatile unsigned int  ADRES27 __attribute__((__sfr__));
#define ADRES28 ADRES28
extern volatile unsigned int  ADRES28 __attribute__((__sfr__));
#define ADRES29 ADRES29
extern volatile unsigned int  ADRES29 __attribute__((__sfr__));
#define ADRES30 ADRES30
extern volatile unsigned int  ADRES30 __attribute__((__sfr__));
#define ADRES31 ADRES31
extern volatile unsigned int  ADRES31 __attribute__((__sfr__));
#define DMACON DMACON
extern volatile unsigned int  DMACON __attribute__((__sfr__));
typedef struct tagDMACONBITS {
  unsigned PRSSEL:1;
  unsigned :14;
  unsigned DMAEN:1;
} DMACONBITS;
extern volatile DMACONBITS DMACONbits __attribute__((__sfr__));

#define DMABUF DMABUF
extern volatile unsigned int  DMABUF __attribute__((__sfr__));
#define DMAL DMAL
extern volatile unsigned int  DMAL __attribute__((__sfr__));
#define DMAH DMAH
extern volatile unsigned int  DMAH __attribute__((__sfr__));
#define DMACH0 DMACH0
extern volatile unsigned int  DMACH0 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH0BITS {
  union {
    struct {
      unsigned CHEN:1;
      unsigned SIZE:1;
      unsigned TRMODE:2;
      unsigned DAMODE:2;
      unsigned SAMODE:2;
      unsigned CHREQ:1;
      unsigned RELOAD:1;
      unsigned NULLW:1;
    };
    struct {
      unsigned :2;
      unsigned TRMODE0:1;
      unsigned TRMODE1:1;
      unsigned DAMODE0:1;
      unsigned DAMODE1:1;
      unsigned SAMODE0:1;
      unsigned SAMODE1:1;
    };
  };
} DMACH0BITS;
