Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
extern volatile ADL1PTRBITS ADL1PTRbits __attribute__((__sfr__));

#define ADL1STAT ADL1STAT
extern volatile unsigned int  ADL1STAT __attribute__((__sfr__));
typedef struct tagADL1STATBITS {
  unsigned :5;
  unsigned ADLIF:1;
  unsigned :1;
  unsigned ADTDLY:1;
  unsigned :6;
  unsigned LBUSY:1;
  unsigned ADTACT:1;
} ADL1STATBITS;
extern volatile ADL1STATBITS ADL1STATbits __attribute__((__sfr__));

#define ADTH1L ADTH1L
extern volatile unsigned int  ADTH1L __attribute__((__sfr__));
typedef struct tagADTH1LBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH1LBITS;
extern volatile ADTH1LBITS ADTH1Lbits __attribute__((__sfr__));

#define ADTH1H ADTH1H
extern volatile unsigned int  ADTH1H __attribute__((__sfr__));
typedef struct tagADTH1HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH1HBITS;
extern volatile ADTH1HBITS ADTH1Hbits __attribute__((__sfr__));

#define ADL1MSEL ADL1MSEL
extern volatile unsigned long long ADL1MSEL __attribute__((__sfr__));
#define ADL1MSEL0 ADL1MSEL0
extern volatile unsigned int  ADL1MSEL0 __attribute__((__sfr__));
typedef struct tagADL1MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL1MSEL0BITS;
extern volatile ADL1MSEL0BITS ADL1MSEL0bits __attribute__((__sfr__));

#define ADL1MSEL1 ADL1MSEL1
extern volatile unsigned int  ADL1MSEL1 __attribute__((__sfr__));
typedef struct tagADL1MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL1MSEL1BITS;
extern volatile ADL1MSEL1BITS ADL1MSEL1bits __attribute__((__sfr__));

#define ADL1MSEL2 ADL1MSEL2
extern volatile unsigned int  ADL1MSEL2 __attribute__((__sfr__));
typedef struct tagADL1MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL1MSEL2BITS;
extern volatile ADL1MSEL2BITS ADL1MSEL2bits __attribute__((__sfr__));

#define ADL1MSEL3 ADL1MSEL3
extern volatile unsigned int  ADL1MSEL3 __attribute__((__sfr__));
typedef struct tagADL1MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL1MSEL3BITS;
extern volatile ADL1MSEL3BITS ADL1MSEL3bits __attribute__((__sfr__));

#define ADL2CON ADL2CON
extern volatile unsigned long ADL2CON __attribute__((__sfr__));
#define ADL2CONL ADL2CONL
extern volatile unsigned int  ADL2CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONLBITS {
  union {
    struct {
      unsigned SLSIZE:6;
      unsigned :1;
      unsigned THSRC:1;
      unsigned SLTSRC:5;
      unsigned SLENCLR:1;
      unsigned SAMP:1;
      unsigned SLEN:1;
    };
    struct {
      unsigned SLSIZE0:1;
      unsigned SLSIZE1:1;
      unsigned SLSIZE2:1;
      unsigned SLSIZE3:1;
      unsigned SLSIZE4:1;
      unsigned SLSIZE5:1;
      unsigned :2;
      unsigned SLTSRC0:1;
      unsigned SLTSRC1:1;
      unsigned SLTSRC2:1;
      unsigned SLTSRC3:1;
      unsigned SLTSRC4:1;
    };
  };
} ADL2CONLBITS;
extern volatile ADL2CONLBITS ADL2CONLbits __attribute__((__sfr__));

#define ADL2CONH ADL2CONH
extern volatile unsigned int  ADL2CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONHBITS {
  union {
    struct {
      unsigned SAMC:5;
      unsigned MULCHEN:1;
      unsigned PINTRIS:1;
      unsigned CTMEN:1;
      unsigned CM:3;
      unsigned WM:2;
      unsigned SLINT:2;
      unsigned ASEN:1;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned :3;
      unsigned CM0:1;
      unsigned CM1:1;
      unsigned CM2:1;
      unsigned WM0:1;
      unsigned WM1:1;
      unsigned SLINT0:1;
      unsigned SLINT1:1;
    };
  };
} ADL2CONHBITS;
extern volatile ADL2CONHBITS ADL2CONHbits __attribute__((__sfr__));

#define ADL2PTR ADL2PTR
extern volatile unsigned int  ADL2PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL2PTRBITS {
  union {
    struct {
      unsigned :8;
      unsigned ADNEXT:7;
    };
    struct {
      unsigned :8;
      unsigned ADNEXT0:1;
      unsigned ADNEXT1:1;
      unsigned ADNEXT2:1;
      unsigned ADNEXT3:1;
      unsigned ADNEXT4:1;
      unsigned ADNEXT5:1;
      unsigned ADNEXT6:1;
    };
  };
} ADL2PTRBITS;
extern volatile ADL2PTRBITS ADL2PTRbits __attribute__((__sfr__));

#define ADL2STAT ADL2STAT
extern volatile unsigned int  ADL2STAT __attribute__((__sfr__));
typedef struct tagADL2STATBITS {
  unsigned :5;
  unsigned ADLIF:1;
  unsigned :1;
  unsigned ADTDLY:1;
  unsigned :6;
  unsigned LBUSY:1;
  unsigned ADTACT:1;
} ADL2STATBITS;
extern volatile ADL2STATBITS ADL2STATbits __attribute__((__sfr__));

#define ADTH2L ADTH2L
extern volatile unsigned int  ADTH2L __attribute__((__sfr__));
typedef struct tagADTH2LBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH2LBITS;
extern volatile ADTH2LBITS ADTH2Lbits __attribute__((__sfr__));

#define ADTH2H ADTH2H
extern volatile unsigned int  ADTH2H __attribute__((__sfr__));
typedef struct tagADTH2HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH2HBITS;
