Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
/* ADL2MSEL2 */
/* Bitname _MSEL32 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL33 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL34 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL35 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL36 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL37 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL38 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL39 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL40 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL41 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL42 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL43 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL44 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL45 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL46 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL47 cannot be defined because it is used by more than one SFR */

/* ADL2MSEL3 */
/* Bitname _MSEL48 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL49 cannot be defined because it is used by more than one SFR */

/* LCDREG */
#define _CKSEL LCDREGbits.CKSEL
#define _MODE13 LCDREGbits.MODE13
#define _BIAS LCDREGbits.BIAS
#define _CPEN LCDREGbits.CPEN
#define _CKSEL0 LCDREGbits.CKSEL0
#define _CKSEL1 LCDREGbits.CKSEL1
#define _BIAS0 LCDREGbits.BIAS0
#define _BIAS1 LCDREGbits.BIAS1
#define _BIAS2 LCDREGbits.BIAS2

/* LCDREF */
#define _LRLAT LCDREFbits.LRLAT
#define _LRLBP LCDREFbits.LRLBP
#define _LRLAP LCDREFbits.LRLAP
#define _VLCD1PE LCDREFbits.VLCD1PE
#define _VLCD2PE LCDREFbits.VLCD2PE
#define _VLCD3PE LCDREFbits.VLCD3PE
#define _LCDCST LCDREFbits.LCDCST
#define _LCDIRE LCDREFbits.LCDIRE
#define _LRLAT0 LCDREFbits.LRLAT0
#define _LRLAT1 LCDREFbits.LRLAT1
#define _LRLAT2 LCDREFbits.LRLAT2
#define _LRLBP0 LCDREFbits.LRLBP0
#define _LRLBP1 LCDREFbits.LRLBP1
#define _LRLAP0 LCDREFbits.LRLAP0
#define _LRLAP1 LCDREFbits.LRLAP1
#define _LCDCST0 LCDREFbits.LCDCST0
#define _LCDCST1 LCDREFbits.LCDCST1
#define _LCDCST2 LCDREFbits.LCDCST2

/* LCDCON */
#define _LMUX LCDCONbits.LMUX
#define _CS LCDCONbits.CS
#define _WERR LCDCONbits.WERR
#define _SLPEN LCDCONbits.SLPEN
#define _LCDSIDL LCDCONbits.LCDSIDL
#define _LCDEN LCDCONbits.LCDEN
#define _LMUX0 LCDCONbits.LMUX0
#define _LMUX1 LCDCONbits.LMUX1
#define _LMUX2 LCDCONbits.LMUX2
#define _CS0 LCDCONbits.CS0
#define _CS1 LCDCONbits.CS1

/* LCDPS */
#define _LP LCDPSbits.LP
#define _WA LCDPSbits.WA
#define _LCDA LCDPSbits.LCDA
#define _BIASMD LCDPSbits.BIASMD
#define _WFT LCDPSbits.WFT
#define _LP0 LCDPSbits.LP0
#define _LP1 LCDPSbits.LP1
#define _LP2 LCDPSbits.LP2
#define _LP3 LCDPSbits.LP3

/* LCDSE0 */
#define _SE00 LCDSE0bits.SE00
#define _SE01 LCDSE0bits.SE01
#define _SE02 LCDSE0bits.SE02
#define _SE03 LCDSE0bits.SE03
#define _SE04 LCDSE0bits.SE04
#define _SE05 LCDSE0bits.SE05
#define _SE06 LCDSE0bits.SE06
#define _SE07 LCDSE0bits.SE07
#define _SE08 LCDSE0bits.SE08
#define _SE09 LCDSE0bits.SE09
#define _SE10 LCDSE0bits.SE10
#define _SE11 LCDSE0bits.SE11
#define _SE12 LCDSE0bits.SE12
#define _SE13 LCDSE0bits.SE13
#define _SE14 LCDSE0bits.SE14
#define _SE15 LCDSE0bits.SE15

/* LCDSE1 */
#define _SE16 LCDSE1bits.SE16
#define _SE17 LCDSE1bits.SE17
#define _SE18 LCDSE1bits.SE18
#define _SE19 LCDSE1bits.SE19
#define _SE20 LCDSE1bits.SE20
#define _SE21 LCDSE1bits.SE21
#define _SE22 LCDSE1bits.SE22
#define _SE23 LCDSE1bits.SE23
#define _SE24 LCDSE1bits.SE24
#define _SE25 LCDSE1bits.SE25
#define _SE26 LCDSE1bits.SE26
#define _SE27 LCDSE1bits.SE27
#define _SE28 LCDSE1bits.SE28
#define _SE29 LCDSE1bits.SE29
#define _SE30 LCDSE1bits.SE30
#define _SE31 LCDSE1bits.SE31

/* LCDSE2 */
#define _SE32 LCDSE2bits.SE32
#define _SE33 LCDSE2bits.SE33
#define _SE34 LCDSE2bits.SE34
#define _SE35 LCDSE2bits.SE35
#define _SE36 LCDSE2bits.SE36
#define _SE37 LCDSE2bits.SE37
#define _SE38 LCDSE2bits.SE38
#define _SE39 LCDSE2bits.SE39
#define _SE40 LCDSE2bits.SE40
#define _SE41 LCDSE2bits.SE41
#define _SE42 LCDSE2bits.SE42
#define _SE43 LCDSE2bits.SE43
#define _SE44 LCDSE2bits.SE44
#define _SE45 LCDSE2bits.SE45
#define _SE46 LCDSE2bits.SE46
#define _SE47 LCDSE2bits.SE47

/* LCDSE3 */
#define _SE48 LCDSE3bits.SE48
#define _SE49 LCDSE3bits.SE49
#define _SE50 LCDSE3bits.SE50
#define _SE51 LCDSE3bits.SE51
#define _SE52 LCDSE3bits.SE52
#define _SE53 LCDSE3bits.SE53
#define _SE54 LCDSE3bits.SE54
#define _SE55 LCDSE3bits.SE55
#define _SE56 LCDSE3bits.SE56
#define _SE57 LCDSE3bits.SE57
#define _SE58 LCDSE3bits.SE58
#define _SE59 LCDSE3bits.SE59
#define _SE60 LCDSE3bits.SE60
#define _SE61 LCDSE3bits.SE61
#define _SE62 LCDSE3bits.SE62
#define _SE63 LCDSE3bits.SE63

/* LCDDATA0 */
#define _S0C0 LCDDATA0bits.S0C0
#define _S1C0 LCDDATA0bits.S1C0
#define _S2C0 LCDDATA0bits.S2C0
#define _S3C0 LCDDATA0bits.S3C0
#define _S4C0 LCDDATA0bits.S4C0
#define _S5C0 LCDDATA0bits.S5C0
#define _S6C0 LCDDATA0bits.S6C0
#define _S7C0 LCDDATA0bits.S7C0
#define _S8C0 LCDDATA0bits.S8C0
#define _S9C0 LCDDATA0bits.S9C0
#define _S10C0 LCDDATA0bits.S10C0
#define _S11C0 LCDDATA0bits.S11C0
#define _S12C0 LCDDATA0bits.S12C0
#define _S13C0 LCDDATA0bits.S13C0
#define _S14C0 LCDDATA0bits.S14C0
#define _S15C0 LCDDATA0bits.S15C0

/* LCDDATA1 */
#define _S16C0 LCDDATA1bits.S16C0
#define _S17C0 LCDDATA1bits.S17C0
#define _S18C0 LCDDATA1bits.S18C0
#define _S19C0 LCDDATA1bits.S19C0
#define _S20C0 LCDDATA1bits.S20C0
#define _S21C0 LCDDATA1bits.S21C0
#define _S22C0 LCDDATA1bits.S22C0
#define _S23C0 LCDDATA1bits.S23C0
#define _S24C0 LCDDATA1bits.S24C0
#define _S25C0 LCDDATA1bits.S25C0
#define _S26C0 LCDDATA1bits.S26C0
#define _S27C0 LCDDATA1bits.S27C0
#define _S28C0 LCDDATA1bits.S28C0
#define _S29C0 LCDDATA1bits.S29C0
#define _S30C0 LCDDATA1bits.S30C0
#define _S31C0 LCDDATA1bits.S31C0

/* LCDDATA2 */
#define _S32C0 LCDDATA2bits.S32C0
#define _S33C0 LCDDATA2bits.S33C0
#define _S34C0 LCDDATA2bits.S34C0
#define _S35C0 LCDDATA2bits.S35C0
#define _S36C0 LCDDATA2bits.S36C0
#define _S37C0 LCDDATA2bits.S37C0
#define _S38C0 LCDDATA2bits.S38C0
#define _S39C0 LCDDATA2bits.S39C0
#define _S40C0 LCDDATA2bits.S40C0
#define _S41C0 LCDDATA2bits.S41C0
#define _S42C0 LCDDATA2bits.S42C0
#define _S43C0 LCDDATA2bits.S43C0
#define _S44C0 LCDDATA2bits.S44C0
#define _S45C0 LCDDATA2bits.S45C0
#define _S46C0 LCDDATA2bits.S46C0
#define _S47C0 LCDDATA2bits.S47C0

/* LCDDATA3 */
#define _S48C0 LCDDATA3bits.S48C0
#define _S49C0 LCDDATA3bits.S49C0
#define _S50C0 LCDDATA3bits.S50C0
#define _S51C0 LCDDATA3bits.S51C0
#define _S52C0 LCDDATA3bits.S52C0
#define _S53C0 LCDDATA3bits.S53C0
#define _S54C0 LCDDATA3bits.S54C0
#define _S55C0 LCDDATA3bits.S55C0
#define _S56C0 LCDDATA3bits.S56C0
#define _S57C0 LCDDATA3bits.S57C0
#define _S58C0 LCDDATA3bits.S58C0
#define _S59C0 LCDDATA3bits.S59C0
#define _S60C0 LCDDATA3bits.S60C0
#define _S61C0 LCDDATA3bits.S61C0
#define _S62C0 LCDDATA3bits.S62C0
#define _S63C0 LCDDATA3bits.S63C0

/* LCDDATA4 */
#define _S0C1 LCDDATA4bits.S0C1
#define _S1C1 LCDDATA4bits.S1C1
#define _S2C1 LCDDATA4bits.S2C1
#define _S3C1 LCDDATA4bits.S3C1
#define _S4C1 LCDDATA4bits.S4C1
#define _S5C1 LCDDATA4bits.S5C1
#define _S6C1 LCDDATA4bits.S6C1
#define _S7C1 LCDDATA4bits.S7C1
#define _S8C1 LCDDATA4bits.S8C1
#define _S9C1 LCDDATA4bits.S9C1
#define _S10C1 LCDDATA4bits.S10C1
#define _S11C1 LCDDATA4bits.S11C1
#define _S12C1 LCDDATA4bits.S12C1
#define _S13C1 LCDDATA4bits.S13C1
#define _S14C1 LCDDATA4bits.S14C1
#define _S15C1 LCDDATA4bits.S15C1

/* LCDDATA5 */
#define _S16C1 LCDDATA5bits.S16C1
#define _S17C1 LCDDATA5bits.S17C1
#define _S18C1 LCDDATA5bits.S18C1
#define _S19C1 LCDDATA5bits.S19C1
#define _S20C1 LCDDATA5bits.S20C1
#define _S21C1 LCDDATA5bits.S21C1
#define _S22C1 LCDDATA5bits.S22C1
#define _S23C1 LCDDATA5bits.S23C1
#define _S24C1 LCDDATA5bits.S24C1
#define _S25C1 LCDDATA5bits.S25C1
#define _S26C1 LCDDATA5bits.S26C1
#define _S27C1 LCDDATA5bits.S27C1
#define _S28C1 LCDDATA5bits.S28C1
#define _S29C1 LCDDATA5bits.S29C1
#define _S30C1 LCDDATA5bits.S30C1
#define _S31C1 LCDDATA5bits.S31C1

