Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
/* LCDDATA20 */
#define _S0C5 LCDDATA20bits.S0C5
#define _S1C5 LCDDATA20bits.S1C5
#define _S2C5 LCDDATA20bits.S2C5
#define _S3C5 LCDDATA20bits.S3C5
#define _S4C5 LCDDATA20bits.S4C5
#define _S5C5 LCDDATA20bits.S5C5
#define _S6C5 LCDDATA20bits.S6C5
#define _S7C5 LCDDATA20bits.S7C5
#define _S8C5 LCDDATA20bits.S8C5
#define _S9C5 LCDDATA20bits.S9C5
#define _S10C5 LCDDATA20bits.S10C5
#define _S11C5 LCDDATA20bits.S11C5
#define _S12C5 LCDDATA20bits.S12C5
#define _S13C5 LCDDATA20bits.S13C5
#define _S14C5 LCDDATA20bits.S14C5
#define _S15C5 LCDDATA20bits.S15C5

/* LCDDATA21 */
#define _S16C5 LCDDATA21bits.S16C5
#define _S17C5 LCDDATA21bits.S17C5
#define _S18C5 LCDDATA21bits.S18C5
#define _S19C5 LCDDATA21bits.S19C5
#define _S20C5 LCDDATA21bits.S20C5
#define _S21C5 LCDDATA21bits.S21C5
#define _S22C5 LCDDATA21bits.S22C5
#define _S23C5 LCDDATA21bits.S23C5
#define _S24C5 LCDDATA21bits.S24C5
#define _S25C5 LCDDATA21bits.S25C5
#define _S26C5 LCDDATA21bits.S26C5
#define _S27C5 LCDDATA21bits.S27C5
#define _S28C5 LCDDATA21bits.S28C5
#define _S29C5 LCDDATA21bits.S29C5
#define _S30C5 LCDDATA21bits.S30C5
#define _S31C5 LCDDATA21bits.S31C5

/* LCDDATA22 */
#define _S32C5 LCDDATA22bits.S32C5
#define _S33C5 LCDDATA22bits.S33C5
#define _S34C5 LCDDATA22bits.S34C5
#define _S35C5 LCDDATA22bits.S35C5
#define _S36C5 LCDDATA22bits.S36C5
#define _S37C5 LCDDATA22bits.S37C5
#define _S38C5 LCDDATA22bits.S38C5
#define _S39C5 LCDDATA22bits.S39C5
#define _S40C5 LCDDATA22bits.S40C5
#define _S41C5 LCDDATA22bits.S41C5
#define _S42C5 LCDDATA22bits.S42C5
#define _S43C5 LCDDATA22bits.S43C5
#define _S44C5 LCDDATA22bits.S44C5
#define _S45C5 LCDDATA22bits.S45C5
#define _S46C5 LCDDATA22bits.S46C5
#define _S47C5 LCDDATA22bits.S47C5

/* LCDDATA23 */
#define _S48C5 LCDDATA23bits.S48C5
#define _S49C5 LCDDATA23bits.S49C5
#define _S50C5 LCDDATA23bits.S50C5
#define _S51C5 LCDDATA23bits.S51C5
#define _S52C5 LCDDATA23bits.S52C5
#define _S53C5 LCDDATA23bits.S53C5
#define _S54C5 LCDDATA23bits.S54C5
#define _S55C5 LCDDATA23bits.S55C5
#define _S56C5 LCDDATA23bits.S56C5
#define _S57C5 LCDDATA23bits.S57C5
#define _S58C5 LCDDATA23bits.S58C5
#define _S59C5 LCDDATA23bits.S59C5
#define _S60C5 LCDDATA23bits.S60C5
#define _S61C5 LCDDATA23bits.S61C5
#define _S62C5 LCDDATA23bits.S62C5
#define _S63C5 LCDDATA23bits.S63C5

/* LCDDATA24 */
#define _S0C6 LCDDATA24bits.S0C6
#define _S1C6 LCDDATA24bits.S1C6
#define _S2C6 LCDDATA24bits.S2C6
#define _S3C6 LCDDATA24bits.S3C6
#define _S4C6 LCDDATA24bits.S4C6
#define _S5C6 LCDDATA24bits.S5C6
#define _S6C6 LCDDATA24bits.S6C6
#define _S7C6 LCDDATA24bits.S7C6
#define _S8C6 LCDDATA24bits.S8C6
#define _S9C6 LCDDATA24bits.S9C6
#define _S10C6 LCDDATA24bits.S10C6
#define _S11C6 LCDDATA24bits.S11C6
#define _S12C6 LCDDATA24bits.S12C6
#define _S13C6 LCDDATA24bits.S13C6
#define _S14C6 LCDDATA24bits.S14C6
#define _S15C6 LCDDATA24bits.S15C6

/* LCDDATA25 */
#define _S16C6 LCDDATA25bits.S16C6
#define _S17C6 LCDDATA25bits.S17C6
#define _S18C6 LCDDATA25bits.S18C6
#define _S19C6 LCDDATA25bits.S19C6
#define _S20C6 LCDDATA25bits.S20C6
#define _S21C6 LCDDATA25bits.S21C6
#define _S22C6 LCDDATA25bits.S22C6
#define _S23C6 LCDDATA25bits.S23C6
#define _S24C6 LCDDATA25bits.S24C6
#define _S25C6 LCDDATA25bits.S25C6
#define _S26C6 LCDDATA25bits.S26C6
#define _S27C6 LCDDATA25bits.S27C6
#define _S28C6 LCDDATA25bits.S28C6
#define _S29C6 LCDDATA25bits.S29C6
#define _S30C6 LCDDATA25bits.S30C6
#define _S31C6 LCDDATA25bits.S31C6

/* LCDDATA26 */
#define _S32C6 LCDDATA26bits.S32C6
#define _S33C6 LCDDATA26bits.S33C6
#define _S34C6 LCDDATA26bits.S34C6
#define _S35C6 LCDDATA26bits.S35C6
#define _S36C6 LCDDATA26bits.S36C6
#define _S37C6 LCDDATA26bits.S37C6
#define _S38C6 LCDDATA26bits.S38C6
#define _S39C6 LCDDATA26bits.S39C6
#define _S40C6 LCDDATA26bits.S40C6
#define _S41C6 LCDDATA26bits.S41C6
#define _S42C6 LCDDATA26bits.S42C6
#define _S43C6 LCDDATA26bits.S43C6
#define _S44C6 LCDDATA26bits.S44C6
#define _S45C6 LCDDATA26bits.S45C6
#define _S46C6 LCDDATA26bits.S46C6
#define _S47C6 LCDDATA26bits.S47C6

/* LCDDATA27 */
#define _S48C6 LCDDATA27bits.S48C6
#define _S49C6 LCDDATA27bits.S49C6
#define _S50C6 LCDDATA27bits.S50C6
#define _S51C6 LCDDATA27bits.S51C6
#define _S52C6 LCDDATA27bits.S52C6
#define _S53C6 LCDDATA27bits.S53C6
#define _S54C6 LCDDATA27bits.S54C6
#define _S55C6 LCDDATA27bits.S55C6
#define _S56C6 LCDDATA27bits.S56C6
#define _S57C6 LCDDATA27bits.S57C6
#define _S58C6 LCDDATA27bits.S58C6
#define _S59C6 LCDDATA27bits.S59C6
#define _S60C6 LCDDATA27bits.S60C6
#define _S61C6 LCDDATA27bits.S61C6
#define _S62C6 LCDDATA27bits.S62C6
#define _S63C6 LCDDATA27bits.S63C6

/* LCDDATA28 */
#define _S0C7 LCDDATA28bits.S0C7
#define _S1C7 LCDDATA28bits.S1C7
#define _S2C7 LCDDATA28bits.S2C7
#define _S3C7 LCDDATA28bits.S3C7
#define _S4C7 LCDDATA28bits.S4C7
#define _S5C7 LCDDATA28bits.S5C7
#define _S6C7 LCDDATA28bits.S6C7
#define _S7C7 LCDDATA28bits.S7C7
#define _S8C7 LCDDATA28bits.S8C7
#define _S9C7 LCDDATA28bits.S9C7
#define _S10C7 LCDDATA28bits.S10C7
#define _S11C7 LCDDATA28bits.S11C7
#define _S12C7 LCDDATA28bits.S12C7
#define _S13C7 LCDDATA28bits.S13C7
#define _S14C7 LCDDATA28bits.S14C7
#define _S15C7 LCDDATA28bits.S15C7

/* LCDDATA29 */
#define _S16C7 LCDDATA29bits.S16C7
#define _S17C7 LCDDATA29bits.S17C7
#define _S18C7 LCDDATA29bits.S18C7
#define _S19C7 LCDDATA29bits.S19C7
#define _S20C7 LCDDATA29bits.S20C7
#define _S21C7 LCDDATA29bits.S21C7
#define _S22C7 LCDDATA29bits.S22C7
#define _S23C7 LCDDATA29bits.S23C7
#define _S24C7 LCDDATA29bits.S24C7
#define _S25C7 LCDDATA29bits.S25C7
#define _S26C7 LCDDATA29bits.S26C7
#define _S27C7 LCDDATA29bits.S27C7
#define _S28C7 LCDDATA29bits.S28C7
#define _S29C7 LCDDATA29bits.S29C7
#define _S30C7 LCDDATA29bits.S30C7
#define _S31C7 LCDDATA29bits.S31C7

/* LCDDATA30 */
#define _S32C7 LCDDATA30bits.S32C7
#define _S33C7 LCDDATA30bits.S33C7
#define _S34C7 LCDDATA30bits.S34C7
#define _S35C7 LCDDATA30bits.S35C7
#define _S36C7 LCDDATA30bits.S36C7
#define _S37C7 LCDDATA30bits.S37C7
#define _S38C7 LCDDATA30bits.S38C7
#define _S39C7 LCDDATA30bits.S39C7
#define _S40C7 LCDDATA30bits.S40C7
#define _S41C7 LCDDATA30bits.S41C7
#define _S42C7 LCDDATA30bits.S42C7
#define _S43C7 LCDDATA30bits.S43C7
#define _S44C7 LCDDATA30bits.S44C7
#define _S45C7 LCDDATA30bits.S45C7
#define _S46C7 LCDDATA30bits.S46C7
#define _S47C7 LCDDATA30bits.S47C7

/* LCDDATA31 */
#define _S48C7 LCDDATA31bits.S48C7
#define _S49C7 LCDDATA31bits.S49C7
#define _S50C7 LCDDATA31bits.S50C7
#define _S51C7 LCDDATA31bits.S51C7
#define _S52C7 LCDDATA31bits.S52C7
#define _S53C7 LCDDATA31bits.S53C7
#define _S54C7 LCDDATA31bits.S54C7
#define _S55C7 LCDDATA31bits.S55C7
#define _S56C7 LCDDATA31bits.S56C7
#define _S57C7 LCDDATA31bits.S57C7
#define _S58C7 LCDDATA31bits.S58C7
#define _S59C7 LCDDATA31bits.S59C7
#define _S60C7 LCDDATA31bits.S60C7
#define _S61C7 LCDDATA31bits.S61C7
#define _S62C7 LCDDATA31bits.S62C7
#define _S63C7 LCDDATA31bits.S63C7

/* PMCON1 */
#define _IRQM PMCON1bits.IRQM
#define _BUSKEEP PMCON1bits.BUSKEEP
#define _ALMODE PMCON1bits.ALMODE
#define _ALP PMCON1bits.ALP
#define _CSF PMCON1bits.CSF
#define _MODE PMCON1bits.MODE
#define _ADRMUX PMCON1bits.ADRMUX
#define _PSIDL PMCON1bits.PSIDL
#define _PMPEN PMCON1bits.PMPEN
#define _IRQM0 PMCON1bits.IRQM0
#define _IRQM1 PMCON1bits.IRQM1
#define _CSF0 PMCON1bits.CSF0
#define _CSF1 PMCON1bits.CSF1
#define _MODE0 PMCON1bits.MODE0
#define _MODE1 PMCON1bits.MODE1
#define _ADRMUX0 PMCON1bits.ADRMUX0
#define _ADRMUX1 PMCON1bits.ADRMUX1

/* PMCON2 */
#define _RADDR PMCON2bits.RADDR
#define _TIMEOUT PMCON2bits.TIMEOUT
#define _ERROR PMCON2bits.ERROR
#define _BUSY PMCON2bits.BUSY
#define _RADDR16 PMCON2bits.RADDR16
#define _RADDR17 PMCON2bits.RADDR17
#define _RADDR18 PMCON2bits.RADDR18
#define _RADDR19 PMCON2bits.RADDR19
#define _RADDR20 PMCON2bits.RADDR20
#define _RADDR21 PMCON2bits.RADDR21
#define _RADDR22 PMCON2bits.RADDR22
#define _RADDR23 PMCON2bits.RADDR23

