Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _ADTBL3_ADCH6_POSITION                   0x00000006
#define _ADTBL3_ADCH6_MASK                       0x00000040
#define _ADTBL3_ADCH6_LENGTH                     0x00000001

#define _ADTBL4_ADCH_POSITION                    0x00000000
#define _ADTBL4_ADCH_MASK                        0x0000007F
#define _ADTBL4_ADCH_LENGTH                      0x00000007

#define _ADTBL4_DIFF_POSITION                    0x0000000E
#define _ADTBL4_DIFF_MASK                        0x00004000
#define _ADTBL4_DIFF_LENGTH                      0x00000001

#define _ADTBL4_UCTMU_POSITION                   0x0000000F
#define _ADTBL4_UCTMU_MASK                       0x00008000
#define _ADTBL4_UCTMU_LENGTH                     0x00000001

#define _ADTBL4_ADCH0_POSITION                   0x00000000
#define _ADTBL4_ADCH0_MASK                       0x00000001
#define _ADTBL4_ADCH0_LENGTH                     0x00000001

#define _ADTBL4_ADCH1_POSITION                   0x00000001
#define _ADTBL4_ADCH1_MASK                       0x00000002
#define _ADTBL4_ADCH1_LENGTH                     0x00000001

#define _ADTBL4_ADCH2_POSITION                   0x00000002
#define _ADTBL4_ADCH2_MASK                       0x00000004
#define _ADTBL4_ADCH2_LENGTH                     0x00000001

#define _ADTBL4_ADCH3_POSITION                   0x00000003
#define _ADTBL4_ADCH3_MASK                       0x00000008
#define _ADTBL4_ADCH3_LENGTH                     0x00000001

#define _ADTBL4_ADCH4_POSITION                   0x00000004
#define _ADTBL4_ADCH4_MASK                       0x00000010
#define _ADTBL4_ADCH4_LENGTH                     0x00000001

#define _ADTBL4_ADCH5_POSITION                   0x00000005
#define _ADTBL4_ADCH5_MASK                       0x00000020
#define _ADTBL4_ADCH5_LENGTH                     0x00000001

#define _ADTBL4_ADCH6_POSITION                   0x00000006
#define _ADTBL4_ADCH6_MASK                       0x00000040
#define _ADTBL4_ADCH6_LENGTH                     0x00000001

#define _ADTBL5_ADCH_POSITION                    0x00000000
#define _ADTBL5_ADCH_MASK                        0x0000007F
#define _ADTBL5_ADCH_LENGTH                      0x00000007

#define _ADTBL5_DIFF_POSITION                    0x0000000E
#define _ADTBL5_DIFF_MASK                        0x00004000
#define _ADTBL5_DIFF_LENGTH                      0x00000001

#define _ADTBL5_UCTMU_POSITION                   0x0000000F
#define _ADTBL5_UCTMU_MASK                       0x00008000
#define _ADTBL5_UCTMU_LENGTH                     0x00000001

#define _ADTBL5_ADCH0_POSITION                   0x00000000
#define _ADTBL5_ADCH0_MASK                       0x00000001
#define _ADTBL5_ADCH0_LENGTH                     0x00000001

#define _ADTBL5_ADCH1_POSITION                   0x00000001
#define _ADTBL5_ADCH1_MASK                       0x00000002
#define _ADTBL5_ADCH1_LENGTH                     0x00000001

#define _ADTBL5_ADCH2_POSITION                   0x00000002
#define _ADTBL5_ADCH2_MASK                       0x00000004
#define _ADTBL5_ADCH2_LENGTH                     0x00000001

#define _ADTBL5_ADCH3_POSITION                   0x00000003
#define _ADTBL5_ADCH3_MASK                       0x00000008
#define _ADTBL5_ADCH3_LENGTH                     0x00000001

#define _ADTBL5_ADCH4_POSITION                   0x00000004
#define _ADTBL5_ADCH4_MASK                       0x00000010
#define _ADTBL5_ADCH4_LENGTH                     0x00000001

#define _ADTBL5_ADCH5_POSITION                   0x00000005
#define _ADTBL5_ADCH5_MASK                       0x00000020
#define _ADTBL5_ADCH5_LENGTH                     0x00000001

#define _ADTBL5_ADCH6_POSITION                   0x00000006
#define _ADTBL5_ADCH6_MASK                       0x00000040
#define _ADTBL5_ADCH6_LENGTH                     0x00000001

#define _ADTBL6_ADCH_POSITION                    0x00000000
#define _ADTBL6_ADCH_MASK                        0x0000007F
#define _ADTBL6_ADCH_LENGTH                      0x00000007

#define _ADTBL6_DIFF_POSITION                    0x0000000E
#define _ADTBL6_DIFF_MASK                        0x00004000
#define _ADTBL6_DIFF_LENGTH                      0x00000001

#define _ADTBL6_UCTMU_POSITION                   0x0000000F
#define _ADTBL6_UCTMU_MASK                       0x00008000
#define _ADTBL6_UCTMU_LENGTH                     0x00000001

#define _ADTBL6_ADCH0_POSITION                   0x00000000
#define _ADTBL6_ADCH0_MASK                       0x00000001
#define _ADTBL6_ADCH0_LENGTH                     0x00000001

#define _ADTBL6_ADCH1_POSITION                   0x00000001
#define _ADTBL6_ADCH1_MASK                       0x00000002
#define _ADTBL6_ADCH1_LENGTH                     0x00000001

#define _ADTBL6_ADCH2_POSITION                   0x00000002
#define _ADTBL6_ADCH2_MASK                       0x00000004
#define _ADTBL6_ADCH2_LENGTH                     0x00000001

#define _ADTBL6_ADCH3_POSITION                   0x00000003
#define _ADTBL6_ADCH3_MASK                       0x00000008
#define _ADTBL6_ADCH3_LENGTH                     0x00000001

#define _ADTBL6_ADCH4_POSITION                   0x00000004
#define _ADTBL6_ADCH4_MASK                       0x00000010
#define _ADTBL6_ADCH4_LENGTH                     0x00000001

#define _ADTBL6_ADCH5_POSITION                   0x00000005
#define _ADTBL6_ADCH5_MASK                       0x00000020
#define _ADTBL6_ADCH5_LENGTH                     0x00000001

#define _ADTBL6_ADCH6_POSITION                   0x00000006
#define _ADTBL6_ADCH6_MASK                       0x00000040
#define _ADTBL6_ADCH6_LENGTH                     0x00000001

#define _ADTBL7_ADCH_POSITION                    0x00000000
#define _ADTBL7_ADCH_MASK                        0x0000007F
#define _ADTBL7_ADCH_LENGTH                      0x00000007

#define _ADTBL7_DIFF_POSITION                    0x0000000E
#define _ADTBL7_DIFF_MASK                        0x00004000
#define _ADTBL7_DIFF_LENGTH                      0x00000001

#define _ADTBL7_UCTMU_POSITION                   0x0000000F
#define _ADTBL7_UCTMU_MASK                       0x00008000
#define _ADTBL7_UCTMU_LENGTH                     0x00000001

#define _ADTBL7_ADCH0_POSITION                   0x00000000
#define _ADTBL7_ADCH0_MASK                       0x00000001
#define _ADTBL7_ADCH0_LENGTH                     0x00000001

#define _ADTBL7_ADCH1_POSITION                   0x00000001
#define _ADTBL7_ADCH1_MASK                       0x00000002
#define _ADTBL7_ADCH1_LENGTH                     0x00000001

#define _ADTBL7_ADCH2_POSITION                   0x00000002
#define _ADTBL7_ADCH2_MASK                       0x00000004
#define _ADTBL7_ADCH2_LENGTH                     0x00000001

