Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _SD1CON1_SDGAIN_POSITION                 0x00000008
#define _SD1CON1_SDGAIN_MASK                     0x00000700
#define _SD1CON1_SDGAIN_LENGTH                   0x00000003

#define _SD1CON1_FILTDIS_POSITION                0x0000000B
#define _SD1CON1_FILTDIS_MASK                    0x00000800
#define _SD1CON1_FILTDIS_LENGTH                  0x00000001

#define _SD1CON1_SDRST_POSITION                  0x0000000C
#define _SD1CON1_SDRST_MASK                      0x00001000
#define _SD1CON1_SDRST_LENGTH                    0x00000001

#define _SD1CON1_SDSIDL_POSITION                 0x0000000D
#define _SD1CON1_SDSIDL_MASK                     0x00002000
#define _SD1CON1_SDSIDL_LENGTH                   0x00000001

#define _SD1CON1_SDON_POSITION                   0x0000000F
#define _SD1CON1_SDON_MASK                       0x00008000
#define _SD1CON1_SDON_LENGTH                     0x00000001

#define _SD1CON1_DITHER0_POSITION                0x00000006
#define _SD1CON1_DITHER0_MASK                    0x00000040
#define _SD1CON1_DITHER0_LENGTH                  0x00000001

#define _SD1CON1_DITHER1_POSITION                0x00000007
#define _SD1CON1_DITHER1_MASK                    0x00000080
#define _SD1CON1_DITHER1_LENGTH                  0x00000001

#define _SD1CON1_SDGAIN0_POSITION                0x00000008
#define _SD1CON1_SDGAIN0_MASK                    0x00000100
#define _SD1CON1_SDGAIN0_LENGTH                  0x00000001

#define _SD1CON1_SDGAIN1_POSITION                0x00000009
#define _SD1CON1_SDGAIN1_MASK                    0x00000200
#define _SD1CON1_SDGAIN1_LENGTH                  0x00000001

#define _SD1CON1_SDGAIN2_POSITION                0x0000000A
#define _SD1CON1_SDGAIN2_MASK                    0x00000400
#define _SD1CON1_SDGAIN2_LENGTH                  0x00000001

#define _SD1CON2_SDRDY_POSITION                  0x00000000
#define _SD1CON2_SDRDY_MASK                      0x00000001
#define _SD1CON2_SDRDY_LENGTH                    0x00000001

#define _SD1CON2_RNDRES_POSITION                 0x00000003
#define _SD1CON2_RNDRES_MASK                     0x00000018
#define _SD1CON2_RNDRES_LENGTH                   0x00000002

#define _SD1CON2_SDWM_POSITION                   0x00000008
#define _SD1CON2_SDWM_MASK                       0x00000300
#define _SD1CON2_SDWM_LENGTH                     0x00000002

#define _SD1CON2_SDINT_POSITION                  0x0000000C
#define _SD1CON2_SDINT_MASK                      0x00003000
#define _SD1CON2_SDINT_LENGTH                    0x00000002

#define _SD1CON2_CHOP_POSITION                   0x0000000E
#define _SD1CON2_CHOP_MASK                       0x0000C000
#define _SD1CON2_CHOP_LENGTH                     0x00000002

#define _SD1CON2_RNDRES0_POSITION                0x00000003
#define _SD1CON2_RNDRES0_MASK                    0x00000008
#define _SD1CON2_RNDRES0_LENGTH                  0x00000001

#define _SD1CON2_RNDRES1_POSITION                0x00000004
#define _SD1CON2_RNDRES1_MASK                    0x00000010
#define _SD1CON2_RNDRES1_LENGTH                  0x00000001

#define _SD1CON2_SDWM0_POSITION                  0x00000008
#define _SD1CON2_SDWM0_MASK                      0x00000100
#define _SD1CON2_SDWM0_LENGTH                    0x00000001

#define _SD1CON2_SDWM1_POSITION                  0x00000009
#define _SD1CON2_SDWM1_MASK                      0x00000200
#define _SD1CON2_SDWM1_LENGTH                    0x00000001

#define _SD1CON2_SDINT0_POSITION                 0x0000000C
#define _SD1CON2_SDINT0_MASK                     0x00001000
#define _SD1CON2_SDINT0_LENGTH                   0x00000001

#define _SD1CON2_SDINT1_POSITION                 0x0000000D
#define _SD1CON2_SDINT1_MASK                     0x00002000
#define _SD1CON2_SDINT1_LENGTH                   0x00000001

#define _SD1CON2_CHOP0_POSITION                  0x0000000E
#define _SD1CON2_CHOP0_MASK                      0x00004000
#define _SD1CON2_CHOP0_LENGTH                    0x00000001

#define _SD1CON2_CHOP1_POSITION                  0x0000000F
#define _SD1CON2_CHOP1_MASK                      0x00008000
#define _SD1CON2_CHOP1_LENGTH                    0x00000001

#define _SD1CON3_SDCH_POSITION                   0x00000000
#define _SD1CON3_SDCH_MASK                       0x00000007
#define _SD1CON3_SDCH_LENGTH                     0x00000003

#define _SD1CON3_SDCS_POSITION                   0x00000008
#define _SD1CON3_SDCS_MASK                       0x00000300
#define _SD1CON3_SDCS_LENGTH                     0x00000002

#define _SD1CON3_SDOSR_POSITION                  0x0000000A
#define _SD1CON3_SDOSR_MASK                      0x00001C00
#define _SD1CON3_SDOSR_LENGTH                    0x00000003

#define _SD1CON3_SDDIV_POSITION                  0x0000000D
#define _SD1CON3_SDDIV_MASK                      0x0000E000
#define _SD1CON3_SDDIV_LENGTH                    0x00000003

#define _SD1CON3_SDCH0_POSITION                  0x00000000
#define _SD1CON3_SDCH0_MASK                      0x00000001
#define _SD1CON3_SDCH0_LENGTH                    0x00000001

#define _SD1CON3_SDCH1_POSITION                  0x00000001
#define _SD1CON3_SDCH1_MASK                      0x00000002
#define _SD1CON3_SDCH1_LENGTH                    0x00000001

#define _SD1CON3_SDCH2_POSITION                  0x00000002
#define _SD1CON3_SDCH2_MASK                      0x00000004
#define _SD1CON3_SDCH2_LENGTH                    0x00000001

#define _SD1CON3_SDCS0_POSITION                  0x00000008
#define _SD1CON3_SDCS0_MASK                      0x00000100
#define _SD1CON3_SDCS0_LENGTH                    0x00000001

#define _SD1CON3_SDCS1_POSITION                  0x00000009
#define _SD1CON3_SDCS1_MASK                      0x00000200
#define _SD1CON3_SDCS1_LENGTH                    0x00000001

#define _SD1CON3_SDOSR0_POSITION                 0x0000000A
#define _SD1CON3_SDOSR0_MASK                     0x00000400
#define _SD1CON3_SDOSR0_LENGTH                   0x00000001

#define _SD1CON3_SDOSR1_POSITION                 0x0000000B
#define _SD1CON3_SDOSR1_MASK                     0x00000800
#define _SD1CON3_SDOSR1_LENGTH                   0x00000001

