Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _ANSD_ANSD5_POSITION                     0x00000005
#define _ANSD_ANSD5_MASK                         0x00000020
#define _ANSD_ANSD5_LENGTH                       0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSD8_POSITION                     0x00000008
#define _ANSD_ANSD8_MASK                         0x00000100
#define _ANSD_ANSD8_LENGTH                       0x00000001

#define _ANSD_ANSD9_POSITION                     0x00000009
#define _ANSD_ANSD9_MASK                         0x00000200
#define _ANSD_ANSD9_LENGTH                       0x00000001

#define _ANSD_ANSD10_POSITION                    0x0000000A
#define _ANSD_ANSD10_MASK                        0x00000400
#define _ANSD_ANSD10_LENGTH                      0x00000001

#define _ANSD_ANSD11_POSITION                    0x0000000B
#define _ANSD_ANSD11_MASK                        0x00000800
#define _ANSD_ANSD11_LENGTH                      0x00000001

#define _ANSD_ANSD12_POSITION                    0x0000000C
#define _ANSD_ANSD12_MASK                        0x00001000
#define _ANSD_ANSD12_LENGTH                      0x00000001

#define _ANSD_ANSD13_POSITION                    0x0000000D
#define _ANSD_ANSD13_MASK                        0x00002000
#define _ANSD_ANSD13_LENGTH                      0x00000001

#define _ANSD_ANSD14_POSITION                    0x0000000E
#define _ANSD_ANSD14_MASK                        0x00004000
#define _ANSD_ANSD14_LENGTH                      0x00000001

#define _ANSD_ANSD15_POSITION                    0x0000000F
#define _ANSD_ANSD15_MASK                        0x00008000
#define _ANSD_ANSD15_LENGTH                      0x00000001

#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSE5_POSITION                     0x00000005
#define _ANSE_ANSE5_MASK                         0x00000020
#define _ANSE_ANSE5_LENGTH                       0x00000001

#define _ANSE_ANSE6_POSITION                     0x00000006
#define _ANSE_ANSE6_MASK                         0x00000040
#define _ANSE_ANSE6_LENGTH                       0x00000001

#define _ANSE_ANSE7_POSITION                     0x00000007
#define _ANSE_ANSE7_MASK                         0x00000080
#define _ANSE_ANSE7_LENGTH                       0x00000001

#define _ANSE_ANSE9_POSITION                     0x00000009
#define _ANSE_ANSE9_MASK                         0x00000200
#define _ANSE_ANSE9_LENGTH                       0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSF_ANSF2_POSITION                     0x00000002
#define _ANSF_ANSF2_MASK                         0x00000004
#define _ANSF_ANSF2_LENGTH                       0x00000001

#define _ANSF_ANSF3_POSITION                     0x00000003
#define _ANSF_ANSF3_MASK                         0x00000008
#define _ANSF_ANSF3_LENGTH                       0x00000001

#define _ANSF_ANSF4_POSITION                     0x00000004
#define _ANSF_ANSF4_MASK                         0x00000010
#define _ANSF_ANSF4_LENGTH                       0x00000001

#define _ANSF_ANSF5_POSITION                     0x00000005
#define _ANSF_ANSF5_MASK                         0x00000020
#define _ANSF_ANSF5_LENGTH                       0x00000001

#define _ANSF_ANSF7_POSITION                     0x00000007
#define _ANSF_ANSF7_MASK                         0x00000080
#define _ANSF_ANSF7_LENGTH                       0x00000001

#define _ANSF_ANSF8_POSITION                     0x00000008
#define _ANSF_ANSF8_MASK                         0x00000100
#define _ANSF_ANSF8_LENGTH                       0x00000001

#define _ANSF_ANSF13_POSITION                    0x0000000D
#define _ANSF_ANSF13_MASK                        0x00002000
#define _ANSF_ANSF13_LENGTH                      0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ANSG_ANSG15_POSITION                    0x0000000F
#define _ANSG_ANSG15_MASK                        0x00008000
#define _ANSG_ANSG15_LENGTH                      0x00000001

#define _ADCON1_PWRLVL_POSITION                  0x00000000
#define _ADCON1_PWRLVL_MASK                      0x00000001
#define _ADCON1_PWRLVL_LENGTH                    0x00000001

#define _ADCON1_ADCAL_POSITION                   0x00000006
#define _ADCON1_ADCAL_MASK                       0x00000040
#define _ADCON1_ADCAL_LENGTH                     0x00000001

#define _ADCON1_PUMPEN_POSITION                  0x00000007
#define _ADCON1_PUMPEN_MASK                      0x00000080
#define _ADCON1_PUMPEN_LENGTH                    0x00000001

#define _ADCON1_FORM_POSITION                    0x00000008
#define _ADCON1_FORM_MASK                        0x00000F00
#define _ADCON1_FORM_LENGTH                      0x00000004

#define _ADCON1_ADSLP_POSITION                   0x0000000C
#define _ADCON1_ADSLP_MASK                       0x00001000
#define _ADCON1_ADSLP_LENGTH                     0x00000001

#define _ADCON1_ADSIDL_POSITION                  0x0000000D
#define _ADCON1_ADSIDL_MASK                      0x00002000
#define _ADCON1_ADSIDL_LENGTH                    0x00000001

#define _ADCON1_ADON_POSITION                    0x0000000F
#define _ADCON1_ADON_MASK                        0x00008000
#define _ADCON1_ADON_LENGTH                      0x00000001

#define _ADCON1_FORM0_POSITION                   0x00000008
#define _ADCON1_FORM0_MASK                       0x00000100
#define _ADCON1_FORM0_LENGTH                     0x00000001

#define _ADCON1_FORM1_POSITION                   0x00000009
#define _ADCON1_FORM1_MASK                       0x00000200
#define _ADCON1_FORM1_LENGTH                     0x00000001

