Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _ADCHITL_CHH11_POSITION                  0x0000000B
#define _ADCHITL_CHH11_MASK                      0x00000800
#define _ADCHITL_CHH11_LENGTH                    0x00000001

#define _ADCHITL_CHH12_POSITION                  0x0000000C
#define _ADCHITL_CHH12_MASK                      0x00001000
#define _ADCHITL_CHH12_LENGTH                    0x00000001

#define _ADCHITL_CHH13_POSITION                  0x0000000D
#define _ADCHITL_CHH13_MASK                      0x00002000
#define _ADCHITL_CHH13_LENGTH                    0x00000001

#define _ADCHITL_CHH14_POSITION                  0x0000000E
#define _ADCHITL_CHH14_MASK                      0x00004000
#define _ADCHITL_CHH14_LENGTH                    0x00000001

#define _ADCHITL_CHH15_POSITION                  0x0000000F
#define _ADCHITL_CHH15_MASK                      0x00008000
#define _ADCHITL_CHH15_LENGTH                    0x00000001

#define _ADCHITH_CHH16_POSITION                  0x00000000
#define _ADCHITH_CHH16_MASK                      0x00000001
#define _ADCHITH_CHH16_LENGTH                    0x00000001

#define _ADCHITH_CHH17_POSITION                  0x00000001
#define _ADCHITH_CHH17_MASK                      0x00000002
#define _ADCHITH_CHH17_LENGTH                    0x00000001

#define _ADCHITH_CHH18_POSITION                  0x00000002
#define _ADCHITH_CHH18_MASK                      0x00000004
#define _ADCHITH_CHH18_LENGTH                    0x00000001

#define _ADCHITH_CHH19_POSITION                  0x00000003
#define _ADCHITH_CHH19_MASK                      0x00000008
#define _ADCHITH_CHH19_LENGTH                    0x00000001

#define _ADCHITH_CHH20_POSITION                  0x00000004
#define _ADCHITH_CHH20_MASK                      0x00000010
#define _ADCHITH_CHH20_LENGTH                    0x00000001

#define _ADCHITH_CHH21_POSITION                  0x00000005
#define _ADCHITH_CHH21_MASK                      0x00000020
#define _ADCHITH_CHH21_LENGTH                    0x00000001

#define _ADCHITH_CHH22_POSITION                  0x00000006
#define _ADCHITH_CHH22_MASK                      0x00000040
#define _ADCHITH_CHH22_LENGTH                    0x00000001

#define _ADCHITH_CHH23_POSITION                  0x00000007
#define _ADCHITH_CHH23_MASK                      0x00000080
#define _ADCHITH_CHH23_LENGTH                    0x00000001

#define _ADCHITH_CHH24_POSITION                  0x00000008
#define _ADCHITH_CHH24_MASK                      0x00000100
#define _ADCHITH_CHH24_LENGTH                    0x00000001

#define _ADCHITH_CHH25_POSITION                  0x00000009
#define _ADCHITH_CHH25_MASK                      0x00000200
#define _ADCHITH_CHH25_LENGTH                    0x00000001

#define _ADCHITH_CHH26_POSITION                  0x0000000A
#define _ADCHITH_CHH26_MASK                      0x00000400
#define _ADCHITH_CHH26_LENGTH                    0x00000001

#define _ADCHITH_CHH27_POSITION                  0x0000000B
#define _ADCHITH_CHH27_MASK                      0x00000800
#define _ADCHITH_CHH27_LENGTH                    0x00000001

#define _ADCHITH_CHH28_POSITION                  0x0000000C
#define _ADCHITH_CHH28_MASK                      0x00001000
#define _ADCHITH_CHH28_LENGTH                    0x00000001

#define _ADCHITH_CHH29_POSITION                  0x0000000D
#define _ADCHITH_CHH29_MASK                      0x00002000
#define _ADCHITH_CHH29_LENGTH                    0x00000001

#define _ADCHITH_CHH30_POSITION                  0x0000000E
#define _ADCHITH_CHH30_MASK                      0x00004000
#define _ADCHITH_CHH30_LENGTH                    0x00000001

#define _ADCHITH_CHH31_POSITION                  0x0000000F
#define _ADCHITH_CHH31_MASK                      0x00008000
#define _ADCHITH_CHH31_LENGTH                    0x00000001

#define _ADL0CONL_SLSIZE_POSITION                0x00000000
#define _ADL0CONL_SLSIZE_MASK                    0x0000003F
#define _ADL0CONL_SLSIZE_LENGTH                  0x00000006

#define _ADL0CONL_THSRC_POSITION                 0x00000007
#define _ADL0CONL_THSRC_MASK                     0x00000080
#define _ADL0CONL_THSRC_LENGTH                   0x00000001

#define _ADL0CONL_SLTSRC_POSITION                0x00000008
#define _ADL0CONL_SLTSRC_MASK                    0x00001F00
#define _ADL0CONL_SLTSRC_LENGTH                  0x00000005

#define _ADL0CONL_SLENCLR_POSITION               0x0000000D
#define _ADL0CONL_SLENCLR_MASK                   0x00002000
#define _ADL0CONL_SLENCLR_LENGTH                 0x00000001

#define _ADL0CONL_SAMP_POSITION                  0x0000000E
#define _ADL0CONL_SAMP_MASK                      0x00004000
#define _ADL0CONL_SAMP_LENGTH                    0x00000001

#define _ADL0CONL_SLEN_POSITION                  0x0000000F
#define _ADL0CONL_SLEN_MASK                      0x00008000
#define _ADL0CONL_SLEN_LENGTH                    0x00000001

#define _ADL0CONL_SLSIZE0_POSITION               0x00000000
#define _ADL0CONL_SLSIZE0_MASK                   0x00000001
#define _ADL0CONL_SLSIZE0_LENGTH                 0x00000001

#define _ADL0CONL_SLSIZE1_POSITION               0x00000001
#define _ADL0CONL_SLSIZE1_MASK                   0x00000002
#define _ADL0CONL_SLSIZE1_LENGTH                 0x00000001

#define _ADL0CONL_SLSIZE2_POSITION               0x00000002
#define _ADL0CONL_SLSIZE2_MASK                   0x00000004
#define _ADL0CONL_SLSIZE2_LENGTH                 0x00000001

#define _ADL0CONL_SLSIZE3_POSITION               0x00000003
#define _ADL0CONL_SLSIZE3_MASK                   0x00000008
#define _ADL0CONL_SLSIZE3_LENGTH                 0x00000001

#define _ADL0CONL_SLSIZE4_POSITION               0x00000004
#define _ADL0CONL_SLSIZE4_MASK                   0x00000010
#define _ADL0CONL_SLSIZE4_LENGTH                 0x00000001

#define _ADL0CONL_SLSIZE5_POSITION               0x00000005
#define _ADL0CONL_SLSIZE5_MASK                   0x00000020
#define _ADL0CONL_SLSIZE5_LENGTH                 0x00000001

#define _ADL0CONL_SLTSRC0_POSITION               0x00000008
#define _ADL0CONL_SLTSRC0_MASK                   0x00000100
#define _ADL0CONL_SLTSRC0_LENGTH                 0x00000001

