Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _ADL1MSEL1_MSEL16_POSITION               0x00000000
#define _ADL1MSEL1_MSEL16_MASK                   0x00000001
#define _ADL1MSEL1_MSEL16_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL17_POSITION               0x00000001
#define _ADL1MSEL1_MSEL17_MASK                   0x00000002
#define _ADL1MSEL1_MSEL17_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL18_POSITION               0x00000002
#define _ADL1MSEL1_MSEL18_MASK                   0x00000004
#define _ADL1MSEL1_MSEL18_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL19_POSITION               0x00000003
#define _ADL1MSEL1_MSEL19_MASK                   0x00000008
#define _ADL1MSEL1_MSEL19_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL20_POSITION               0x00000004
#define _ADL1MSEL1_MSEL20_MASK                   0x00000010
#define _ADL1MSEL1_MSEL20_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL21_POSITION               0x00000005
#define _ADL1MSEL1_MSEL21_MASK                   0x00000020
#define _ADL1MSEL1_MSEL21_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL22_POSITION               0x00000006
#define _ADL1MSEL1_MSEL22_MASK                   0x00000040
#define _ADL1MSEL1_MSEL22_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL23_POSITION               0x00000007
#define _ADL1MSEL1_MSEL23_MASK                   0x00000080
#define _ADL1MSEL1_MSEL23_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL24_POSITION               0x00000008
#define _ADL1MSEL1_MSEL24_MASK                   0x00000100
#define _ADL1MSEL1_MSEL24_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL25_POSITION               0x00000009
#define _ADL1MSEL1_MSEL25_MASK                   0x00000200
#define _ADL1MSEL1_MSEL25_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL26_POSITION               0x0000000A
#define _ADL1MSEL1_MSEL26_MASK                   0x00000400
#define _ADL1MSEL1_MSEL26_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL27_POSITION               0x0000000B
#define _ADL1MSEL1_MSEL27_MASK                   0x00000800
#define _ADL1MSEL1_MSEL27_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL28_POSITION               0x0000000C
#define _ADL1MSEL1_MSEL28_MASK                   0x00001000
#define _ADL1MSEL1_MSEL28_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL29_POSITION               0x0000000D
#define _ADL1MSEL1_MSEL29_MASK                   0x00002000
#define _ADL1MSEL1_MSEL29_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL30_POSITION               0x0000000E
#define _ADL1MSEL1_MSEL30_MASK                   0x00004000
#define _ADL1MSEL1_MSEL30_LENGTH                 0x00000001

#define _ADL1MSEL1_MSEL31_POSITION               0x0000000F
#define _ADL1MSEL1_MSEL31_MASK                   0x00008000
#define _ADL1MSEL1_MSEL31_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL32_POSITION               0x00000000
#define _ADL1MSEL2_MSEL32_MASK                   0x00000001
#define _ADL1MSEL2_MSEL32_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL33_POSITION               0x00000001
#define _ADL1MSEL2_MSEL33_MASK                   0x00000002
#define _ADL1MSEL2_MSEL33_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL34_POSITION               0x00000002
#define _ADL1MSEL2_MSEL34_MASK                   0x00000004
#define _ADL1MSEL2_MSEL34_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL35_POSITION               0x00000003
#define _ADL1MSEL2_MSEL35_MASK                   0x00000008
#define _ADL1MSEL2_MSEL35_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL36_POSITION               0x00000004
#define _ADL1MSEL2_MSEL36_MASK                   0x00000010
#define _ADL1MSEL2_MSEL36_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL37_POSITION               0x00000005
#define _ADL1MSEL2_MSEL37_MASK                   0x00000020
#define _ADL1MSEL2_MSEL37_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL38_POSITION               0x00000006
#define _ADL1MSEL2_MSEL38_MASK                   0x00000040
#define _ADL1MSEL2_MSEL38_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL39_POSITION               0x00000007
#define _ADL1MSEL2_MSEL39_MASK                   0x00000080
#define _ADL1MSEL2_MSEL39_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL40_POSITION               0x00000008
#define _ADL1MSEL2_MSEL40_MASK                   0x00000100
#define _ADL1MSEL2_MSEL40_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL41_POSITION               0x00000009
#define _ADL1MSEL2_MSEL41_MASK                   0x00000200
#define _ADL1MSEL2_MSEL41_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL42_POSITION               0x0000000A
#define _ADL1MSEL2_MSEL42_MASK                   0x00000400
#define _ADL1MSEL2_MSEL42_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL43_POSITION               0x0000000B
#define _ADL1MSEL2_MSEL43_MASK                   0x00000800
#define _ADL1MSEL2_MSEL43_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL44_POSITION               0x0000000C
#define _ADL1MSEL2_MSEL44_MASK                   0x00001000
#define _ADL1MSEL2_MSEL44_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL45_POSITION               0x0000000D
#define _ADL1MSEL2_MSEL45_MASK                   0x00002000
#define _ADL1MSEL2_MSEL45_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL46_POSITION               0x0000000E
#define _ADL1MSEL2_MSEL46_MASK                   0x00004000
#define _ADL1MSEL2_MSEL46_LENGTH                 0x00000001

#define _ADL1MSEL2_MSEL47_POSITION               0x0000000F
#define _ADL1MSEL2_MSEL47_MASK                   0x00008000
#define _ADL1MSEL2_MSEL47_LENGTH                 0x00000001

#define _ADL1MSEL3_MSEL48_POSITION               0x00000000
#define _ADL1MSEL3_MSEL48_MASK                   0x00000001
#define _ADL1MSEL3_MSEL48_LENGTH                 0x00000001

#define _ADL1MSEL3_MSEL49_POSITION               0x00000001
#define _ADL1MSEL3_MSEL49_MASK                   0x00000002
#define _ADL1MSEL3_MSEL49_LENGTH                 0x00000001

