Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _LCDDATA12_S2C3_POSITION                 0x00000002
#define _LCDDATA12_S2C3_MASK                     0x00000004
#define _LCDDATA12_S2C3_LENGTH                   0x00000001

#define _LCDDATA12_S3C3_POSITION                 0x00000003
#define _LCDDATA12_S3C3_MASK                     0x00000008
#define _LCDDATA12_S3C3_LENGTH                   0x00000001

#define _LCDDATA12_S4C3_POSITION                 0x00000004
#define _LCDDATA12_S4C3_MASK                     0x00000010
#define _LCDDATA12_S4C3_LENGTH                   0x00000001

#define _LCDDATA12_S5C3_POSITION                 0x00000005
#define _LCDDATA12_S5C3_MASK                     0x00000020
#define _LCDDATA12_S5C3_LENGTH                   0x00000001

#define _LCDDATA12_S6C3_POSITION                 0x00000006
#define _LCDDATA12_S6C3_MASK                     0x00000040
#define _LCDDATA12_S6C3_LENGTH                   0x00000001

#define _LCDDATA12_S7C3_POSITION                 0x00000007
#define _LCDDATA12_S7C3_MASK                     0x00000080
#define _LCDDATA12_S7C3_LENGTH                   0x00000001

#define _LCDDATA12_S8C3_POSITION                 0x00000008
#define _LCDDATA12_S8C3_MASK                     0x00000100
#define _LCDDATA12_S8C3_LENGTH                   0x00000001

#define _LCDDATA12_S9C3_POSITION                 0x00000009
#define _LCDDATA12_S9C3_MASK                     0x00000200
#define _LCDDATA12_S9C3_LENGTH                   0x00000001

#define _LCDDATA12_S10C3_POSITION                0x0000000A
#define _LCDDATA12_S10C3_MASK                    0x00000400
#define _LCDDATA12_S10C3_LENGTH                  0x00000001

#define _LCDDATA12_S11C3_POSITION                0x0000000B
#define _LCDDATA12_S11C3_MASK                    0x00000800
#define _LCDDATA12_S11C3_LENGTH                  0x00000001

#define _LCDDATA12_S12C3_POSITION                0x0000000C
#define _LCDDATA12_S12C3_MASK                    0x00001000
#define _LCDDATA12_S12C3_LENGTH                  0x00000001

#define _LCDDATA12_S13C3_POSITION                0x0000000D
#define _LCDDATA12_S13C3_MASK                    0x00002000
#define _LCDDATA12_S13C3_LENGTH                  0x00000001

#define _LCDDATA12_S14C3_POSITION                0x0000000E
#define _LCDDATA12_S14C3_MASK                    0x00004000
#define _LCDDATA12_S14C3_LENGTH                  0x00000001

#define _LCDDATA12_S15C3_POSITION                0x0000000F
#define _LCDDATA12_S15C3_MASK                    0x00008000
#define _LCDDATA12_S15C3_LENGTH                  0x00000001

#define _LCDDATA13_S16C3_POSITION                0x00000000
#define _LCDDATA13_S16C3_MASK                    0x00000001
#define _LCDDATA13_S16C3_LENGTH                  0x00000001

#define _LCDDATA13_S17C3_POSITION                0x00000001
#define _LCDDATA13_S17C3_MASK                    0x00000002
#define _LCDDATA13_S17C3_LENGTH                  0x00000001

#define _LCDDATA13_S18C3_POSITION                0x00000002
#define _LCDDATA13_S18C3_MASK                    0x00000004
#define _LCDDATA13_S18C3_LENGTH                  0x00000001

#define _LCDDATA13_S19C3_POSITION                0x00000003
#define _LCDDATA13_S19C3_MASK                    0x00000008
#define _LCDDATA13_S19C3_LENGTH                  0x00000001

#define _LCDDATA13_S20C3_POSITION                0x00000004
#define _LCDDATA13_S20C3_MASK                    0x00000010
#define _LCDDATA13_S20C3_LENGTH                  0x00000001

#define _LCDDATA13_S21C3_POSITION                0x00000005
#define _LCDDATA13_S21C3_MASK                    0x00000020
#define _LCDDATA13_S21C3_LENGTH                  0x00000001

#define _LCDDATA13_S22C3_POSITION                0x00000006
#define _LCDDATA13_S22C3_MASK                    0x00000040
#define _LCDDATA13_S22C3_LENGTH                  0x00000001

#define _LCDDATA13_S23C3_POSITION                0x00000007
#define _LCDDATA13_S23C3_MASK                    0x00000080
#define _LCDDATA13_S23C3_LENGTH                  0x00000001

#define _LCDDATA13_S24C3_POSITION                0x00000008
#define _LCDDATA13_S24C3_MASK                    0x00000100
#define _LCDDATA13_S24C3_LENGTH                  0x00000001

#define _LCDDATA13_S25C3_POSITION                0x00000009
#define _LCDDATA13_S25C3_MASK                    0x00000200
#define _LCDDATA13_S25C3_LENGTH                  0x00000001

#define _LCDDATA13_S26C3_POSITION                0x0000000A
#define _LCDDATA13_S26C3_MASK                    0x00000400
#define _LCDDATA13_S26C3_LENGTH                  0x00000001

#define _LCDDATA13_S27C3_POSITION                0x0000000B
#define _LCDDATA13_S27C3_MASK                    0x00000800
#define _LCDDATA13_S27C3_LENGTH                  0x00000001

#define _LCDDATA13_S28C3_POSITION                0x0000000C
#define _LCDDATA13_S28C3_MASK                    0x00001000
#define _LCDDATA13_S28C3_LENGTH                  0x00000001

#define _LCDDATA13_S29C3_POSITION                0x0000000D
#define _LCDDATA13_S29C3_MASK                    0x00002000
#define _LCDDATA13_S29C3_LENGTH                  0x00000001

#define _LCDDATA13_S30C3_POSITION                0x0000000E
#define _LCDDATA13_S30C3_MASK                    0x00004000
#define _LCDDATA13_S30C3_LENGTH                  0x00000001

#define _LCDDATA13_S31C3_POSITION                0x0000000F
#define _LCDDATA13_S31C3_MASK                    0x00008000
#define _LCDDATA13_S31C3_LENGTH                  0x00000001

#define _LCDDATA14_S32C3_POSITION                0x00000000
#define _LCDDATA14_S32C3_MASK                    0x00000001
#define _LCDDATA14_S32C3_LENGTH                  0x00000001

#define _LCDDATA14_S33C3_POSITION                0x00000001
#define _LCDDATA14_S33C3_MASK                    0x00000002
#define _LCDDATA14_S33C3_LENGTH                  0x00000001

#define _LCDDATA14_S34C3_POSITION                0x00000002
#define _LCDDATA14_S34C3_MASK                    0x00000004
#define _LCDDATA14_S34C3_LENGTH                  0x00000001

#define _LCDDATA14_S35C3_POSITION                0x00000003
#define _LCDDATA14_S35C3_MASK                    0x00000008
#define _LCDDATA14_S35C3_LENGTH                  0x00000001

#define _LCDDATA14_S36C3_POSITION                0x00000004
#define _LCDDATA14_S36C3_MASK                    0x00000010
#define _LCDDATA14_S36C3_LENGTH                  0x00000001

#define _LCDDATA14_S37C3_POSITION                0x00000005
#define _LCDDATA14_S37C3_MASK                    0x00000020
#define _LCDDATA14_S37C3_LENGTH                  0x00000001

#define _LCDDATA14_S38C3_POSITION                0x00000006
#define _LCDDATA14_S38C3_MASK                    0x00000040
#define _LCDDATA14_S38C3_LENGTH                  0x00000001

#define _LCDDATA14_S39C3_POSITION                0x00000007
#define _LCDDATA14_S39C3_MASK                    0x00000080
#define _LCDDATA14_S39C3_LENGTH                  0x00000001

