Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _LCDDATA19_S50C4_POSITION                0x00000002
#define _LCDDATA19_S50C4_MASK                    0x00000004
#define _LCDDATA19_S50C4_LENGTH                  0x00000001

#define _LCDDATA19_S51C4_POSITION                0x00000003
#define _LCDDATA19_S51C4_MASK                    0x00000008
#define _LCDDATA19_S51C4_LENGTH                  0x00000001

#define _LCDDATA19_S52C4_POSITION                0x00000004
#define _LCDDATA19_S52C4_MASK                    0x00000010
#define _LCDDATA19_S52C4_LENGTH                  0x00000001

#define _LCDDATA19_S53C4_POSITION                0x00000005
#define _LCDDATA19_S53C4_MASK                    0x00000020
#define _LCDDATA19_S53C4_LENGTH                  0x00000001

#define _LCDDATA19_S54C4_POSITION                0x00000006
#define _LCDDATA19_S54C4_MASK                    0x00000040
#define _LCDDATA19_S54C4_LENGTH                  0x00000001

#define _LCDDATA19_S55C4_POSITION                0x00000007
#define _LCDDATA19_S55C4_MASK                    0x00000080
#define _LCDDATA19_S55C4_LENGTH                  0x00000001

#define _LCDDATA19_S56C4_POSITION                0x00000008
#define _LCDDATA19_S56C4_MASK                    0x00000100
#define _LCDDATA19_S56C4_LENGTH                  0x00000001

#define _LCDDATA19_S57C4_POSITION                0x00000009
#define _LCDDATA19_S57C4_MASK                    0x00000200
#define _LCDDATA19_S57C4_LENGTH                  0x00000001

#define _LCDDATA19_S58C4_POSITION                0x0000000A
#define _LCDDATA19_S58C4_MASK                    0x00000400
#define _LCDDATA19_S58C4_LENGTH                  0x00000001

#define _LCDDATA19_S59C4_POSITION                0x0000000B
#define _LCDDATA19_S59C4_MASK                    0x00000800
#define _LCDDATA19_S59C4_LENGTH                  0x00000001

#define _LCDDATA19_S60C4_POSITION                0x0000000C
#define _LCDDATA19_S60C4_MASK                    0x00001000
#define _LCDDATA19_S60C4_LENGTH                  0x00000001

#define _LCDDATA19_S61C4_POSITION                0x0000000D
#define _LCDDATA19_S61C4_MASK                    0x00002000
#define _LCDDATA19_S61C4_LENGTH                  0x00000001

#define _LCDDATA19_S62C4_POSITION                0x0000000E
#define _LCDDATA19_S62C4_MASK                    0x00004000
#define _LCDDATA19_S62C4_LENGTH                  0x00000001

#define _LCDDATA19_S63C4_POSITION                0x0000000F
#define _LCDDATA19_S63C4_MASK                    0x00008000
#define _LCDDATA19_S63C4_LENGTH                  0x00000001

#define _LCDDATA20_S0C5_POSITION                 0x00000000
#define _LCDDATA20_S0C5_MASK                     0x00000001
#define _LCDDATA20_S0C5_LENGTH                   0x00000001

#define _LCDDATA20_S1C5_POSITION                 0x00000001
#define _LCDDATA20_S1C5_MASK                     0x00000002
#define _LCDDATA20_S1C5_LENGTH                   0x00000001

#define _LCDDATA20_S2C5_POSITION                 0x00000002
#define _LCDDATA20_S2C5_MASK                     0x00000004
#define _LCDDATA20_S2C5_LENGTH                   0x00000001

#define _LCDDATA20_S3C5_POSITION                 0x00000003
#define _LCDDATA20_S3C5_MASK                     0x00000008
#define _LCDDATA20_S3C5_LENGTH                   0x00000001

#define _LCDDATA20_S4C5_POSITION                 0x00000004
#define _LCDDATA20_S4C5_MASK                     0x00000010
#define _LCDDATA20_S4C5_LENGTH                   0x00000001

#define _LCDDATA20_S5C5_POSITION                 0x00000005
#define _LCDDATA20_S5C5_MASK                     0x00000020
#define _LCDDATA20_S5C5_LENGTH                   0x00000001

#define _LCDDATA20_S6C5_POSITION                 0x00000006
#define _LCDDATA20_S6C5_MASK                     0x00000040
#define _LCDDATA20_S6C5_LENGTH                   0x00000001

#define _LCDDATA20_S7C5_POSITION                 0x00000007
#define _LCDDATA20_S7C5_MASK                     0x00000080
#define _LCDDATA20_S7C5_LENGTH                   0x00000001

#define _LCDDATA20_S8C5_POSITION                 0x00000008
#define _LCDDATA20_S8C5_MASK                     0x00000100
#define _LCDDATA20_S8C5_LENGTH                   0x00000001

#define _LCDDATA20_S9C5_POSITION                 0x00000009
#define _LCDDATA20_S9C5_MASK                     0x00000200
#define _LCDDATA20_S9C5_LENGTH                   0x00000001

#define _LCDDATA20_S10C5_POSITION                0x0000000A
#define _LCDDATA20_S10C5_MASK                    0x00000400
#define _LCDDATA20_S10C5_LENGTH                  0x00000001

#define _LCDDATA20_S11C5_POSITION                0x0000000B
#define _LCDDATA20_S11C5_MASK                    0x00000800
#define _LCDDATA20_S11C5_LENGTH                  0x00000001

#define _LCDDATA20_S12C5_POSITION                0x0000000C
#define _LCDDATA20_S12C5_MASK                    0x00001000
#define _LCDDATA20_S12C5_LENGTH                  0x00000001

#define _LCDDATA20_S13C5_POSITION                0x0000000D
#define _LCDDATA20_S13C5_MASK                    0x00002000
#define _LCDDATA20_S13C5_LENGTH                  0x00000001

#define _LCDDATA20_S14C5_POSITION                0x0000000E
#define _LCDDATA20_S14C5_MASK                    0x00004000
#define _LCDDATA20_S14C5_LENGTH                  0x00000001

#define _LCDDATA20_S15C5_POSITION                0x0000000F
#define _LCDDATA20_S15C5_MASK                    0x00008000
#define _LCDDATA20_S15C5_LENGTH                  0x00000001

#define _LCDDATA21_S16C5_POSITION                0x00000000
#define _LCDDATA21_S16C5_MASK                    0x00000001
#define _LCDDATA21_S16C5_LENGTH                  0x00000001

#define _LCDDATA21_S17C5_POSITION                0x00000001
#define _LCDDATA21_S17C5_MASK                    0x00000002
#define _LCDDATA21_S17C5_LENGTH                  0x00000001

#define _LCDDATA21_S18C5_POSITION                0x00000002
#define _LCDDATA21_S18C5_MASK                    0x00000004
#define _LCDDATA21_S18C5_LENGTH                  0x00000001

#define _LCDDATA21_S19C5_POSITION                0x00000003
#define _LCDDATA21_S19C5_MASK                    0x00000008
#define _LCDDATA21_S19C5_LENGTH                  0x00000001

