Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _LCDDATA21_S20C5_POSITION                0x00000004
#define _LCDDATA21_S20C5_MASK                    0x00000010
#define _LCDDATA21_S20C5_LENGTH                  0x00000001

#define _LCDDATA21_S21C5_POSITION                0x00000005
#define _LCDDATA21_S21C5_MASK                    0x00000020
#define _LCDDATA21_S21C5_LENGTH                  0x00000001

#define _LCDDATA21_S22C5_POSITION                0x00000006
#define _LCDDATA21_S22C5_MASK                    0x00000040
#define _LCDDATA21_S22C5_LENGTH                  0x00000001

#define _LCDDATA21_S23C5_POSITION                0x00000007
#define _LCDDATA21_S23C5_MASK                    0x00000080
#define _LCDDATA21_S23C5_LENGTH                  0x00000001

#define _LCDDATA21_S24C5_POSITION                0x00000008
#define _LCDDATA21_S24C5_MASK                    0x00000100
#define _LCDDATA21_S24C5_LENGTH                  0x00000001

#define _LCDDATA21_S25C5_POSITION                0x00000009
#define _LCDDATA21_S25C5_MASK                    0x00000200
#define _LCDDATA21_S25C5_LENGTH                  0x00000001

#define _LCDDATA21_S26C5_POSITION                0x0000000A
#define _LCDDATA21_S26C5_MASK                    0x00000400
#define _LCDDATA21_S26C5_LENGTH                  0x00000001

#define _LCDDATA21_S27C5_POSITION                0x0000000B
#define _LCDDATA21_S27C5_MASK                    0x00000800
#define _LCDDATA21_S27C5_LENGTH                  0x00000001

#define _LCDDATA21_S28C5_POSITION                0x0000000C
#define _LCDDATA21_S28C5_MASK                    0x00001000
#define _LCDDATA21_S28C5_LENGTH                  0x00000001

#define _LCDDATA21_S29C5_POSITION                0x0000000D
#define _LCDDATA21_S29C5_MASK                    0x00002000
#define _LCDDATA21_S29C5_LENGTH                  0x00000001

#define _LCDDATA21_S30C5_POSITION                0x0000000E
#define _LCDDATA21_S30C5_MASK                    0x00004000
#define _LCDDATA21_S30C5_LENGTH                  0x00000001

#define _LCDDATA21_S31C5_POSITION                0x0000000F
#define _LCDDATA21_S31C5_MASK                    0x00008000
#define _LCDDATA21_S31C5_LENGTH                  0x00000001

#define _LCDDATA22_S32C5_POSITION                0x00000000
#define _LCDDATA22_S32C5_MASK                    0x00000001
#define _LCDDATA22_S32C5_LENGTH                  0x00000001

#define _LCDDATA22_S33C5_POSITION                0x00000001
#define _LCDDATA22_S33C5_MASK                    0x00000002
#define _LCDDATA22_S33C5_LENGTH                  0x00000001

#define _LCDDATA22_S34C5_POSITION                0x00000002
#define _LCDDATA22_S34C5_MASK                    0x00000004
#define _LCDDATA22_S34C5_LENGTH                  0x00000001

#define _LCDDATA22_S35C5_POSITION                0x00000003
#define _LCDDATA22_S35C5_MASK                    0x00000008
#define _LCDDATA22_S35C5_LENGTH                  0x00000001

#define _LCDDATA22_S36C5_POSITION                0x00000004
#define _LCDDATA22_S36C5_MASK                    0x00000010
#define _LCDDATA22_S36C5_LENGTH                  0x00000001

#define _LCDDATA22_S37C5_POSITION                0x00000005
#define _LCDDATA22_S37C5_MASK                    0x00000020
#define _LCDDATA22_S37C5_LENGTH                  0x00000001

#define _LCDDATA22_S38C5_POSITION                0x00000006
#define _LCDDATA22_S38C5_MASK                    0x00000040
#define _LCDDATA22_S38C5_LENGTH                  0x00000001

#define _LCDDATA22_S39C5_POSITION                0x00000007
#define _LCDDATA22_S39C5_MASK                    0x00000080
#define _LCDDATA22_S39C5_LENGTH                  0x00000001

#define _LCDDATA22_S40C5_POSITION                0x00000008
#define _LCDDATA22_S40C5_MASK                    0x00000100
#define _LCDDATA22_S40C5_LENGTH                  0x00000001

#define _LCDDATA22_S41C5_POSITION                0x00000009
#define _LCDDATA22_S41C5_MASK                    0x00000200
#define _LCDDATA22_S41C5_LENGTH                  0x00000001

#define _LCDDATA22_S42C5_POSITION                0x0000000A
#define _LCDDATA22_S42C5_MASK                    0x00000400
#define _LCDDATA22_S42C5_LENGTH                  0x00000001

#define _LCDDATA22_S43C5_POSITION                0x0000000B
#define _LCDDATA22_S43C5_MASK                    0x00000800
#define _LCDDATA22_S43C5_LENGTH                  0x00000001

#define _LCDDATA22_S44C5_POSITION                0x0000000C
#define _LCDDATA22_S44C5_MASK                    0x00001000
#define _LCDDATA22_S44C5_LENGTH                  0x00000001

#define _LCDDATA22_S45C5_POSITION                0x0000000D
#define _LCDDATA22_S45C5_MASK                    0x00002000
#define _LCDDATA22_S45C5_LENGTH                  0x00000001

#define _LCDDATA22_S46C5_POSITION                0x0000000E
#define _LCDDATA22_S46C5_MASK                    0x00004000
#define _LCDDATA22_S46C5_LENGTH                  0x00000001

#define _LCDDATA22_S47C5_POSITION                0x0000000F
#define _LCDDATA22_S47C5_MASK                    0x00008000
#define _LCDDATA22_S47C5_LENGTH                  0x00000001

#define _LCDDATA23_S48C5_POSITION                0x00000000
#define _LCDDATA23_S48C5_MASK                    0x00000001
#define _LCDDATA23_S48C5_LENGTH                  0x00000001

#define _LCDDATA23_S49C5_POSITION                0x00000001
#define _LCDDATA23_S49C5_MASK                    0x00000002
#define _LCDDATA23_S49C5_LENGTH                  0x00000001

#define _LCDDATA23_S50C5_POSITION                0x00000002
#define _LCDDATA23_S50C5_MASK                    0x00000004
#define _LCDDATA23_S50C5_LENGTH                  0x00000001

#define _LCDDATA23_S51C5_POSITION                0x00000003
#define _LCDDATA23_S51C5_MASK                    0x00000008
#define _LCDDATA23_S51C5_LENGTH                  0x00000001

#define _LCDDATA23_S52C5_POSITION                0x00000004
#define _LCDDATA23_S52C5_MASK                    0x00000010
#define _LCDDATA23_S52C5_LENGTH                  0x00000001

#define _LCDDATA23_S53C5_POSITION                0x00000005
#define _LCDDATA23_S53C5_MASK                    0x00000020
#define _LCDDATA23_S53C5_LENGTH                  0x00000001

