Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _LCDDATA23_S54C5_POSITION                0x00000006
#define _LCDDATA23_S54C5_MASK                    0x00000040
#define _LCDDATA23_S54C5_LENGTH                  0x00000001

#define _LCDDATA23_S55C5_POSITION                0x00000007
#define _LCDDATA23_S55C5_MASK                    0x00000080
#define _LCDDATA23_S55C5_LENGTH                  0x00000001

#define _LCDDATA23_S56C5_POSITION                0x00000008
#define _LCDDATA23_S56C5_MASK                    0x00000100
#define _LCDDATA23_S56C5_LENGTH                  0x00000001

#define _LCDDATA23_S57C5_POSITION                0x00000009
#define _LCDDATA23_S57C5_MASK                    0x00000200
#define _LCDDATA23_S57C5_LENGTH                  0x00000001

#define _LCDDATA23_S58C5_POSITION                0x0000000A
#define _LCDDATA23_S58C5_MASK                    0x00000400
#define _LCDDATA23_S58C5_LENGTH                  0x00000001

#define _LCDDATA23_S59C5_POSITION                0x0000000B
#define _LCDDATA23_S59C5_MASK                    0x00000800
#define _LCDDATA23_S59C5_LENGTH                  0x00000001

#define _LCDDATA23_S60C5_POSITION                0x0000000C
#define _LCDDATA23_S60C5_MASK                    0x00001000
#define _LCDDATA23_S60C5_LENGTH                  0x00000001

#define _LCDDATA23_S61C5_POSITION                0x0000000D
#define _LCDDATA23_S61C5_MASK                    0x00002000
#define _LCDDATA23_S61C5_LENGTH                  0x00000001

#define _LCDDATA23_S62C5_POSITION                0x0000000E
#define _LCDDATA23_S62C5_MASK                    0x00004000
#define _LCDDATA23_S62C5_LENGTH                  0x00000001

#define _LCDDATA23_S63C5_POSITION                0x0000000F
#define _LCDDATA23_S63C5_MASK                    0x00008000
#define _LCDDATA23_S63C5_LENGTH                  0x00000001

#define _LCDDATA24_S0C6_POSITION                 0x00000000
#define _LCDDATA24_S0C6_MASK                     0x00000001
#define _LCDDATA24_S0C6_LENGTH                   0x00000001

#define _LCDDATA24_S1C6_POSITION                 0x00000001
#define _LCDDATA24_S1C6_MASK                     0x00000002
#define _LCDDATA24_S1C6_LENGTH                   0x00000001

#define _LCDDATA24_S2C6_POSITION                 0x00000002
#define _LCDDATA24_S2C6_MASK                     0x00000004
#define _LCDDATA24_S2C6_LENGTH                   0x00000001

#define _LCDDATA24_S3C6_POSITION                 0x00000003
#define _LCDDATA24_S3C6_MASK                     0x00000008
#define _LCDDATA24_S3C6_LENGTH                   0x00000001

#define _LCDDATA24_S4C6_POSITION                 0x00000004
#define _LCDDATA24_S4C6_MASK                     0x00000010
#define _LCDDATA24_S4C6_LENGTH                   0x00000001

#define _LCDDATA24_S5C6_POSITION                 0x00000005
#define _LCDDATA24_S5C6_MASK                     0x00000020
#define _LCDDATA24_S5C6_LENGTH                   0x00000001

#define _LCDDATA24_S6C6_POSITION                 0x00000006
#define _LCDDATA24_S6C6_MASK                     0x00000040
#define _LCDDATA24_S6C6_LENGTH                   0x00000001

#define _LCDDATA24_S7C6_POSITION                 0x00000007
#define _LCDDATA24_S7C6_MASK                     0x00000080
#define _LCDDATA24_S7C6_LENGTH                   0x00000001

#define _LCDDATA24_S8C6_POSITION                 0x00000008
#define _LCDDATA24_S8C6_MASK                     0x00000100
#define _LCDDATA24_S8C6_LENGTH                   0x00000001

#define _LCDDATA24_S9C6_POSITION                 0x00000009
#define _LCDDATA24_S9C6_MASK                     0x00000200
#define _LCDDATA24_S9C6_LENGTH                   0x00000001

#define _LCDDATA24_S10C6_POSITION                0x0000000A
#define _LCDDATA24_S10C6_MASK                    0x00000400
#define _LCDDATA24_S10C6_LENGTH                  0x00000001

#define _LCDDATA24_S11C6_POSITION                0x0000000B
#define _LCDDATA24_S11C6_MASK                    0x00000800
#define _LCDDATA24_S11C6_LENGTH                  0x00000001

#define _LCDDATA24_S12C6_POSITION                0x0000000C
#define _LCDDATA24_S12C6_MASK                    0x00001000
#define _LCDDATA24_S12C6_LENGTH                  0x00000001

#define _LCDDATA24_S13C6_POSITION                0x0000000D
#define _LCDDATA24_S13C6_MASK                    0x00002000
#define _LCDDATA24_S13C6_LENGTH                  0x00000001

#define _LCDDATA24_S14C6_POSITION                0x0000000E
#define _LCDDATA24_S14C6_MASK                    0x00004000
#define _LCDDATA24_S14C6_LENGTH                  0x00000001

#define _LCDDATA24_S15C6_POSITION                0x0000000F
#define _LCDDATA24_S15C6_MASK                    0x00008000
#define _LCDDATA24_S15C6_LENGTH                  0x00000001

#define _LCDDATA25_S16C6_POSITION                0x00000000
#define _LCDDATA25_S16C6_MASK                    0x00000001
#define _LCDDATA25_S16C6_LENGTH                  0x00000001

#define _LCDDATA25_S17C6_POSITION                0x00000001
#define _LCDDATA25_S17C6_MASK                    0x00000002
#define _LCDDATA25_S17C6_LENGTH                  0x00000001

#define _LCDDATA25_S18C6_POSITION                0x00000002
#define _LCDDATA25_S18C6_MASK                    0x00000004
#define _LCDDATA25_S18C6_LENGTH                  0x00000001

#define _LCDDATA25_S19C6_POSITION                0x00000003
#define _LCDDATA25_S19C6_MASK                    0x00000008
#define _LCDDATA25_S19C6_LENGTH                  0x00000001

#define _LCDDATA25_S20C6_POSITION                0x00000004
#define _LCDDATA25_S20C6_MASK                    0x00000010
#define _LCDDATA25_S20C6_LENGTH                  0x00000001

#define _LCDDATA25_S21C6_POSITION                0x00000005
#define _LCDDATA25_S21C6_MASK                    0x00000020
#define _LCDDATA25_S21C6_LENGTH                  0x00000001

#define _LCDDATA25_S22C6_POSITION                0x00000006
#define _LCDDATA25_S22C6_MASK                    0x00000040
#define _LCDDATA25_S22C6_LENGTH                  0x00000001

#define _LCDDATA25_S23C6_POSITION                0x00000007
#define _LCDDATA25_S23C6_MASK                    0x00000080
#define _LCDDATA25_S23C6_LENGTH                  0x00000001

#define _LCDDATA25_S24C6_POSITION                0x00000008
#define _LCDDATA25_S24C6_MASK                    0x00000100
#define _LCDDATA25_S24C6_LENGTH                  0x00000001

#define _LCDDATA25_S25C6_POSITION                0x00000009
#define _LCDDATA25_S25C6_MASK                    0x00000200
#define _LCDDATA25_S25C6_LENGTH                  0x00000001

