Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GC010.h
#define _CRCXORL_X14_POSITION                    0x0000000E
#define _CRCXORL_X14_MASK                        0x00004000
#define _CRCXORL_X14_LENGTH                      0x00000001

#define _CRCXORL_X15_POSITION                    0x0000000F
#define _CRCXORL_X15_MASK                        0x00008000
#define _CRCXORL_X15_LENGTH                      0x00000001

#define _CRCXORH_X16_POSITION                    0x00000000
#define _CRCXORH_X16_MASK                        0x00000001
#define _CRCXORH_X16_LENGTH                      0x00000001

#define _CRCXORH_X17_POSITION                    0x00000001
#define _CRCXORH_X17_MASK                        0x00000002
#define _CRCXORH_X17_LENGTH                      0x00000001

#define _CRCXORH_X18_POSITION                    0x00000002
#define _CRCXORH_X18_MASK                        0x00000004
#define _CRCXORH_X18_LENGTH                      0x00000001

#define _CRCXORH_X19_POSITION                    0x00000003
#define _CRCXORH_X19_MASK                        0x00000008
#define _CRCXORH_X19_LENGTH                      0x00000001

#define _CRCXORH_X20_POSITION                    0x00000004
#define _CRCXORH_X20_MASK                        0x00000010
#define _CRCXORH_X20_LENGTH                      0x00000001

#define _CRCXORH_X21_POSITION                    0x00000005
#define _CRCXORH_X21_MASK                        0x00000020
#define _CRCXORH_X21_LENGTH                      0x00000001

#define _CRCXORH_X22_POSITION                    0x00000006
#define _CRCXORH_X22_MASK                        0x00000040
#define _CRCXORH_X22_LENGTH                      0x00000001

#define _CRCXORH_X23_POSITION                    0x00000007
#define _CRCXORH_X23_MASK                        0x00000080
#define _CRCXORH_X23_LENGTH                      0x00000001

#define _CRCXORH_X24_POSITION                    0x00000008
#define _CRCXORH_X24_MASK                        0x00000100
#define _CRCXORH_X24_LENGTH                      0x00000001

#define _CRCXORH_X25_POSITION                    0x00000009
#define _CRCXORH_X25_MASK                        0x00000200
#define _CRCXORH_X25_LENGTH                      0x00000001

#define _CRCXORH_X26_POSITION                    0x0000000A
#define _CRCXORH_X26_MASK                        0x00000400
#define _CRCXORH_X26_LENGTH                      0x00000001

#define _CRCXORH_X27_POSITION                    0x0000000B
#define _CRCXORH_X27_MASK                        0x00000800
#define _CRCXORH_X27_LENGTH                      0x00000001

#define _CRCXORH_X28_POSITION                    0x0000000C
#define _CRCXORH_X28_MASK                        0x00001000
#define _CRCXORH_X28_LENGTH                      0x00000001

#define _CRCXORH_X29_POSITION                    0x0000000D
#define _CRCXORH_X29_MASK                        0x00002000
#define _CRCXORH_X29_LENGTH                      0x00000001

#define _CRCXORH_X30_POSITION                    0x0000000E
#define _CRCXORH_X30_MASK                        0x00004000
#define _CRCXORH_X30_LENGTH                      0x00000001

#define _CRCXORH_X31_POSITION                    0x0000000F
#define _CRCXORH_X31_MASK                        0x00008000
#define _CRCXORH_X31_LENGTH                      0x00000001

#define _BUFCON0_BUFREF_POSITION                 0x00000000
#define _BUFCON0_BUFREF_MASK                     0x00000003
#define _BUFCON0_BUFREF_LENGTH                   0x00000002

#define _BUFCON0_BUFSTBY_POSITION                0x00000006
#define _BUFCON0_BUFSTBY_MASK                    0x00000040
#define _BUFCON0_BUFSTBY_LENGTH                  0x00000001

#define _BUFCON0_BUFSLP_POSITION                 0x0000000C
#define _BUFCON0_BUFSLP_MASK                     0x00001000
#define _BUFCON0_BUFSLP_LENGTH                   0x00000001

#define _BUFCON0_BUFSIDL_POSITION                0x0000000D
#define _BUFCON0_BUFSIDL_MASK                    0x00002000
#define _BUFCON0_BUFSIDL_LENGTH                  0x00000001

#define _BUFCON0_BUFEN_POSITION                  0x0000000F
#define _BUFCON0_BUFEN_MASK                      0x00008000
#define _BUFCON0_BUFEN_LENGTH                    0x00000001

#define _BUFCON0_BUFREF0_POSITION                0x00000000
#define _BUFCON0_BUFREF0_MASK                    0x00000001
#define _BUFCON0_BUFREF0_LENGTH                  0x00000001

#define _BUFCON0_BUFREF1_POSITION                0x00000001
#define _BUFCON0_BUFREF1_MASK                    0x00000002
#define _BUFCON0_BUFREF1_LENGTH                  0x00000001

#define _BUFCON1_BUFREF_POSITION                 0x00000000
#define _BUFCON1_BUFREF_MASK                     0x00000003
#define _BUFCON1_BUFREF_LENGTH                   0x00000002

#define _BUFCON1_BUFSTBY_POSITION                0x00000006
#define _BUFCON1_BUFSTBY_MASK                    0x00000040
#define _BUFCON1_BUFSTBY_LENGTH                  0x00000001

#define _BUFCON1_BUFOE_POSITION                  0x00000007
#define _BUFCON1_BUFOE_MASK                      0x00000080
#define _BUFCON1_BUFOE_LENGTH                    0x00000001

#define _BUFCON1_BUFSLP_POSITION                 0x0000000C
#define _BUFCON1_BUFSLP_MASK                     0x00001000
#define _BUFCON1_BUFSLP_LENGTH                   0x00000001

#define _BUFCON1_BUFSIDL_POSITION                0x0000000D
#define _BUFCON1_BUFSIDL_MASK                    0x00002000
#define _BUFCON1_BUFSIDL_LENGTH                  0x00000001

#define _BUFCON1_BUFEN_POSITION                  0x0000000F
#define _BUFCON1_BUFEN_MASK                      0x00008000
#define _BUFCON1_BUFEN_LENGTH                    0x00000001

#define _BUFCON1_BUFREF0_POSITION                0x00000000
#define _BUFCON1_BUFREF0_MASK                    0x00000001
#define _BUFCON1_BUFREF0_LENGTH                  0x00000001

#define _BUFCON1_BUFREF1_POSITION                0x00000001
#define _BUFCON1_BUFREF1_MASK                    0x00000002
#define _BUFCON1_BUFREF1_LENGTH                  0x00000001

#define _BUFCON2_BUFREF_POSITION                 0x00000000
#define _BUFCON2_BUFREF_MASK                     0x00000003
#define _BUFCON2_BUFREF_LENGTH                   0x00000002

